{
    "name": "M. A. R. Chughtai",
    "year": "1897 - 1975",
    "intro": "While M. Abdur Rahman  Chughtai’s early watercolours bear the stamp of Abanindranath Tagore’s revivalist Bengal School, by the 1940s he had created his own style, a commingling of the Bengal School, Mughal art, and miniature and Islamic traditions of art.",
    "bio": "Born into a family of artists in Lahore on 21 September 1897, Chughtai learnt to draw from his father, Mia Karim Baksh. He joined Mayo School of Art in Lahore in 1911, where Samarendranath Gupta, a pupil of Abanindranath Tagore, was vice-principal. He obtained a diploma in photo lithography from Mayo School in 1914, where he went on to become the head instructor in chromo-lithography.\nChughtai honed his printmaking skills during visits to London in the mid-1930s and exhibited his works across Europe; he also exhibited with Indian Society of Oriental Art in Calcutta around this time. Despite Pakistani claims on his heritage, his contribution towards the entire subcontinent’s art is substantial—his subjects ranged from Buddhist themes, Hindu epics, stories from Radha-Krishna mythology, as well as illustrative paintings on Ghalib’s poetry and the Rubaiyat of Omar Khayyam.\nAs Pakistan’s national artist, his publication, Amal-i-Chughtai, and original works were gifted to visiting heads of states. He also designed postal stamps and insignia for Radio Pakistan and Pakistan Television. He was awarded Pakistan’s highest honours—Hilal-i-Imtiaz in 1960, and the Presidential medal for the Pride of Performance in 1968. He passed away in Lahore on 17 January 1975.",
    "CurrentProductId": "2159",
    "LastArtProId": "3058",
    "profile": "https://dagworld.com/m.a.r.chughtai.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mar_chughtai.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chughtaiar015.jpg",
            "title": "Flame of Love",
            "year": null,
            "medium": "Watercolour wash on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chughtaiar019.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chughtaiar022.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Etching on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chughtaiar07.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Etching on paper"
        }
    ]
}