{
    "name": "M. K. Parandekar",
    "year": "1877 - 1961",
    "intro": "Born in Kolhapur, Maharashtra, M. K. Parandekar was a prolific painter—he made panoramic views of archaeological sites, landscapes and portraits.",
    "bio": "His initial training was under his father, a Sanskrit scholar and painter, and he followed that up with formal study at Sir J. J. School of Art, Bombay. Abalal Rahiman, the court painter of Kolhapur state who had also trained at Sir J. J. School of Art, was a strong influence on Parandekar’s art, and he achieved considerable expertise in drawing portraits and figures. However, his focus remained landscapes. He became one of the earliest modern Indian artists to paint Indian landscape in the outdoors, along with M. V. Dhurandhar, S. L. Haldankar, M. R. Acharekar, and others, with an intimacy that was lacking in the oeuvre of the European artists. His landscapes of the ghats of Nasik and the Mahalaxmi temple, Kolhapur, as well as the mountainscapes of Mahabaleshwar, were greatly admired by critics as well as art lovers in his time.\nParandekar’s panoramic views of Indian archaeological sites, with their picturesque ambience, recall European masters in their use of perspective and three-dimensional effects. He acquired the patronage of Lord Willingdon, then governor of Bombay, as well as the maharaja of Patiala, who commissioned him to paint several projects. Parandekar played an important role in the foundation of the Art Society of India, and served as the secretary of the Archaeological Survey of India from 1920-30. He passed away in 1961.",
    "CurrentProductId": "2162",
    "LastArtProId": "3062",
    "profile": "https://dagworld.com/m.k.parandekar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/k/mk_parandekar.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parandekar09.jpg",
            "title": "Untitled",
            "year": null,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parandekar25.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on box board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parandekar32.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on oil paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parandekar44.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on paper pasted on paper"
        }
    ]
}