{
    "name": "M. Reddeppa Naidu",
    "year": "1932 - 1999",
    "intro": "Born in a village in the East Godavari district of Andhra Pradesh, Reddeppa Naidu acquired his formal education in Kakinada and later studied at the Government College of Art and Craft, Madras, where he was mentored by K. C. S. Paniker. He held his first exhibition in Madras in 1958.",
    "bio": "His academic training and the challenge in identifying his own visual language made Naidu transform images to match both his urban and artistic sensibilities. In the 1950s and ’60s, the dilemma of the south Indian tradition vis-à-vis the impact of Western modernism haunted most southern artists who were thinking of the ‘modern’ in the Indian context. Naidu forsook Western modernism for images from Hindu mythology and religious iconography in the ’70s—a trend that had begun to show in his work in the previous decade—rendered in free lines drawn with dry brush strokes. Notable were his works in the Mahabharata series followed by the Ramayana and Musicians. He also did works culled from the Adiparva episode of the Mahabharata in which Shakuntala is given special attention.\nNaidu participated in art shows globally, chief among which were the Paris Biennale of 1965, Sao Paolo Biennale of 1969 and 1971, and the fourth India Triennale in New Delhi in 1978. He received the Lalit Kala Akademi’s national award in 1962, and the Hyderabad Art Society’s gold medal in 1967.\nHe passed away at Cholamandal Artists’ Village in 1999.",
    "CurrentProductId": "2357",
    "LastArtProId": "3040",
    "profile": "https://dagworld.com/m-reddeppa-naidu.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/e/redappa_naidu_cover_2.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/naidur073.jpg",
            "title": "Untitled (Ganesha)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/naidur201.jpg",
            "title": "Untitled",
            "year": 1972,
            "medium": "Oil and ink on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/naidur204.jpg",
            "title": "Krishna and Gopis",
            "year": 1978,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/naidur207.jpg",
            "title": "Devi",
            "year": 1977,
            "medium": "Oil on canvas laid on plywood"
        }
    ]
}