{
    "name": "M. S. Joshi",
    "year": "1912 - 2001",
    "intro": "M.S. Joshi combined his training in academic realism with a sense of vitality, precision and aesthetics to reveal India’s rich cityscapes and landscapes in his watercolour and gouache works.",
    "bio": "There was immense depth in the rendering of his subjects, which included people, places, architectural elements, all done in a subdued yet textured palette.\nBorn in Nashik, Maharashtra, he studied at Sir J. J. School of Art, Bombay, in the 1930s. Regarded as an important educator, Joshi was one of the founding members—and later principal—of the Model Art Education Society and Institute, established in 1939 in Dadar, Bombay. He also took an active interest in Marathi theatre, directing dramas while also being involved with the stage settings and costumes.\nThe artist’s works have rich texture, a rich palette of not just colour but also an artistic vision that is unique and individualistic.  A deeply profound visual aesthetic has allowed Joshi’s art to be collected widely all over the world, and his works have been part of permanent collections in prestigious museums in the U.K., Australia, and Japan, among others.\nBetween the 1950s-70s, Joshi received several awards from the Bombay Art Society, Hyderabad Art Society, Mysore Dasarao Exhibition, All India Fine Arts and Crafts Society, among others. In 1964, Joshi received the national award from the Lalit Kala Akademi.",
    "CurrentProductId": "2164",
    "LastArtProId": "3044",
    "profile": "https://dagworld.com/m.s.joshi.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/s/ms_joshi.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/o/joshims01.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/o/joshims05.jpg",
            "title": "Seabeach, Bombay",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/o/joshims07.jpg",
            "title": "Rainy Day",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/o/joshims14.jpg",
            "title": "Khandala in Rain",
            "year": null,
            "medium": "Watercolour on handmade paper"
        }
    ]
}