{
    "name": "M. Senathipathi",
    "year": "b - 1939",
    "intro": "A student of K. C. S. Paniker—the influential artist-teacher and founding father of the Madras Art Movement—M. Senathipathi is known for his richly textured works drawn from mythology and contextualised in contemporary social issues.",
    "bio": "Among the earliest artists to move to Cholamandal Artists’ Village on the outskirts of Madras founded by his mentor, Senathipathi obtained a diploma in drawing and painting from the Government College of Art and Craft in 1965. Memories of rites and rituals of his religious family that included an uncle who painted images of Hindu deities have remained an integral part of his vocabulary, as also the folk tales narrated to him in childhood by his mother—as a young boy, he would admire the images of deities in the puja room of his home in Chengalpet near Madras. His lines, too, are drawn from kolam patterns, yantric diagrams, and geometric folk forms.\nA unique feature of Senathipathi’s art is the transparent, stained-glass effect that he brings to his works. In the mid-1970s, he started working exclusively with pen and ink wash, immersing handmade paper in water before delineating his linear composition on it. The pressure of the nib or brush on wet paper gave rise to blots, smudges and sfumato effects, creating textures and enhancing the work’s character.\nIn 1988, Senathipathi received a British Council grant to travel to different parts of Europe. Besides India, Senathipathi has exhibited in Poland, Germany, Malaysia, Holland, and Morocco. The artist lives and works in Chennai.",
    "CurrentProductId": "2165",
    "LastArtProId": "3047",
    "profile": "https://dagworld.com/m.senathipathi.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/_/m_senathipati.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senathipatim40_1.jpg",
            "title": "Untitled",
            "year": 1975,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senathipatim42.jpg",
            "title": "Untitled",
            "year": 1981,
            "medium": "Ink and charcoal on handmade paper pasted on plywood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senathipatim51.jpg",
            "title": "Krishna and Gopis",
            "year": 1967,
            "medium": "Ink, watercolour and gouache on paper"
        }
    ]
}