{
    "name": "M. Suriyamoorthy",
    "year": "1944 - 2012",
    "intro": "An important artist of the Madras Group that synthesised modernism by melding Indian traditions with Western modernist techniques under the direction of K. C. S. Paniker, M. Suriyamoorthy’s visual language employed emphatic regional and folk imagery.",
    "bio": "Born on 16 August 1944, Suriyamoorthy was an experimental artist known for unusual innovations—he made paintings with the waters of various Indian rivers considered holy, and made colours by grinding seashells and medical ingredients left behind by his father who was a practitioner of the indigenous medical science of Siddha. In later years, he also worked in mixed media, oil and acrylic colours.\nPainting in the figurative tradition, Suriyamoorthy’s canvases were a smörgasbord of traditional regional influences such as the Lepakshi murals, the kolam culture of making decorative patterns on floor with rice flour, textile motifs, and south India’s plastic tradition. The female figure remained a constant muse, whether in the form of a deity or a middleclass housewife. Thematically, his animated compositions oscillated between domesticity, dance and music performances, vegetable and fruit sellers, marriage and ear-piercing ceremonies, the antics of a snake charmer, and iconic representations of the Hindu pantheon of gods. Dividing the space through geometric grids, he placed within it vignettes of pastoral life. His canvases were inscribed with the English script, reflecting the tradition of the Madras Art Movement.\nWinning the Lalit Kala Akademi’s national award at the age of twenty-one, Suriyamoorthy remained active in Madras (now Chennai) until the late 1980s, after which he shifted to Singapore.",
    "CurrentProductId": "2166",
    "LastArtProId": "3054",
    "profile": "https://dagworld.com/m.suriyamoorthy.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/_/m_suriyamoorthy_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suriyamurthym04.jpg",
            "title": "Gandhi Thoughts",
            "year": 1991,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suryamurthym011.jpg",
            "title": "Untitled",
            "year": 1992,
            "medium": "Enamel on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suryamurthym012.jpg",
            "title": "Untitled",
            "year": 1992,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suryamurthym025.jpg",
            "title": "Untitled",
            "year": 1992,
            "medium": "Oil and enamel on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suryamurthym43.jpg",
            "title": "Untitled",
            "year": 1966,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suryamurthym377.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil and enamel on canvas"
        }
    ]
}