{
    "name": "M. V. Dhurandhar",
    "year": "1867 - 1944",
    "intro": "Possibly the most popular academic Indian artist after Raja Ravi Varma, M. V. Dhurandhar was born in Kolhapur.",
    "bio": "An early interest in drawing led his father to admit him to Sir J. J. School of Art, Bombay, where he received special encouragement from its principal, John Griffiths.\nDhurandhar tasted early success with a gold medal from Bombay Art Society for his oil painting, Have You Come Laxmi? just as he completed his five-year course in 1895, becoming the first Indian to be awarded this prestigious medal. He continued to be associated with his alma mater, joining as a teacher soon upon graduation. At the end of an illustrious teaching career, he became the school’s first Indian director in 1930.\nThe Abanindranath Tagore-led revivalist movement had taken hold of Bengal as a reaction to British academic dominance in the late nineteenth-early twentieth centuries. Bombay artists, on the other hand, were doing commissioned works that were academic in their rendering and technique but within an indigenous context, becoming known as history painters. Dhurandhar remained the most significant among them, maintaining a balance between academic realism and popular commercial art.\nThrough his prolific output, Dhurandhar chronicled contemporary society in his paintings and popular postcards. His well-known works include a series on Bombay and its people, scenes from Hindu mythology, illustrations for the Rubaiyat of Omar Khayyam, among others. Otto Rothfeld’s book Women of India, published in Bombay in 1920, was illustrated by Dhurandhar, as was Percival and Olivia Strip’s The Peoples of India in 1944.",
    "CurrentProductId": "2167",
    "LastArtProId": "5854",
    "profile": "https://dagworld.com/m.v.dhurandhar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/v/mv_dhurandhar_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv130.jpg",
            "title": "Todi Ragini",
            "year": 1919,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv131.jpg",
            "title": "Untitled",
            "year": 1910,
            "medium": "Oil on oil paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv165_1.jpg",
            "title": "Woman in Profile",
            "year": 1892,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv167.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour and graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv149.jpg",
            "title": "Shriram Viwaha",
            "year": null,
            "medium": "Oleograph on paper pasted on magazine paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhurandharmv150_1.jpg",
            "title": "Indira Devi",
            "year": null,
            "medium": "Oleograph on paper"
        }
    ]
}