{
    "name": "Maniklal Banerjee",
    "year": "1916 - 2002",
    "intro": "A watercolourist par excellence known for his paintings on silk, Maniklal Banerjee was born in Borisal in present-day Bangladesh.",
    "bio": "He studied at Government College of Art in Calcutta and while still a student, became the first Indian artist to receive the Government of India’s scholarship for the arts.\nHis watercolour on silk paintings stood out for his control over the medium on a difficult surface, and for the range of subjects he portrayed—from scenes of daily life in rural India to Vedic and tantric philosophies. Mostly narrative and figurative, his paintings depicted life’s pleasures and pains within a spiritual worldview. A harmony of colours and control over lines made him a perfectionist in his own style.\nA celebrated painter, Banerjee was equally well-known as a teacher, fondly remembered by his students at Government College of Arts and Crafts in Calcutta, where he had joined as a lecturer in 1939 and retired in 1977. He imparted the difficult technique of painting in watercolours on silk to his students and helped popularise it.\nBesides painting, he wrote extensively on art in publications such as Modern Review, Anupjaan, Prabasi, and Uttarshuri. He also brought out three sketch books in Bengali and produced a documentary on art for Doordarshan, Calcutta. Banerjee held fifty solo shows in India and abroad and served on the judging committee of many prestigious art institutions such as the Birla Academy of Art and Culture, Academy of Fine Arts, and Rajya Charukala, all in Calcutta.",
    "CurrentProductId": "2169",
    "LastArtProId": "3072",
    "profile": "https://dagworld.com/maniklalbanerjee.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maniklal_banerjee_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/banerjeeml028.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on silk pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/banerjeeml091.jpg",
            "title": "Untitled",
            "year": 1987,
            "medium": "Watercolour on silk pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/banerjeeml096.jpg",
            "title": "Goddess Sasthi",
            "year": 1995,
            "medium": "Watercolour on silk pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/banerjeeml111.jpg",
            "title": "Untitled",
            "year": 1983,
            "medium": "Watercolour on silk pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/banerjeeml122.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on silk pasted on mount board"
        }
    ]
}