{
    "name": "Manjit Bawa",
    "year": "1941 - 2008",
    "intro": "Sufi poetry, spirituality and music inspired Manjit Bawa's signature rounded forms suspended against rich, flat grounds.",
    "bio": "Born in Dhuri, Punjab, he was encouraged by his brothers to pursue art and he studied at Delhi Polytechnic from 1958-63 under eminent artist-teachers Somnath Hore, Dhanraj Bhagat, B. C. Sanyal, and Abani Sen. He moved to England in 1964, where he worked as a silkscreen printmaker and studied at London School of Painting.\nUpon his return after eight years, he taught at his alma mater, Delhi’s College of Art, from 1975-77, and began the discovery of his painterly identity. Not wishing to paint in an European-derived style, Bawa began exploring Indian mythology, folktales and love legends as themes for his work. His colour palette too was Indian, with vibrant reds, oranges, yellows, greens and blues providing the background for his works. Nature, birds and animals occurred frequently, along with the flute, suggesting the major Hindu deity, the flute-playing Krishna, or the tragic romantic hero Ranjha from the work of the eighteenth century Punjabi Sufi poet, Waris Shah.\nBawa established a silkscreen workshop at Lalit Kala Akademi’s Garhi Studios in New Delhi, achieving in his prints the same luminescent colours as his paintings. The 1984 anti-Sikh riots in Delhi saw him organise peace marches.  Bawa received the Lalit Kala Akademi’s national award in 1980, was awarded at the first Bharat Bhavan Biennale, Bhopal, in 1986, and received the Dayawati Modi annual award in 2000. He lived mostly in New Delhi, where he passed away on 29 December 2008.",
    "CurrentProductId": "2170",
    "LastArtProId": "3075",
    "profile": "https://dagworld.com/manjitbawa.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/manjit_bawa.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bawam04c.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bawam03c.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bawam092.jpg",
            "title": "With Love N. I.",
            "year": 1977,
            "medium": "Serigraph on paper"
        }
    ]
}