{
    "name": "Manu Parekh",
    "year": "b - 1939",
    "intro": "Manu Parekh’s paintings on the infamous Bhagalpur blindings in 1980 reveal his deep response to humanity, in much the same way as Guernica was Picasso’s response to the horrors of war.",
    "bio": "Born in Ahmedabad, Gujarat, Manu Parekh studied at Sir J. J. School of Art, Bombay. With influences as varied as Arshile Gorky, Roberto Matta, S. B. Palsikar and Rabindranath Tagore, Parekh has always sought to explore his inner landscape through art.\nPerhaps best known for his Banaras series, Parekh’s works are characterised by his intuitive use of colour, bold brushstrokes, and prominent lines. He has experimented with colourful abstractions, sexual imagery, and figuration, responding as much to nature as to daily life and social issues. The women in his works are represented as nature spirits, plant forms, germinating seeds and allegorical figures, recalling mythological traditions.\nStage designer, art designer, actor and artist, Manu Parekh brings diverse perspectives to his work. Craft has been a long-term interest and association with the Weavers’ Service Centre as a consultant designer gave him the opportunity to work with craftsmen. He has travelled widely across India studying the indigenous techniques and styles of folk artists.\nParekh received the President of India’s silver plaque and the All India Fine Arts and Crafts Society’s award in 1972, and the national award of the Lalit Kala Akademi, New Delhi, in 1982. In 1992, he was honoured with the Padma Shri by the Government of India. His retrospective show at National Gallery of Modern Art also travelled to Mumbai and Bengaluru. He lives and works in New Delhi along with his artist wife, Madhvi Parekh.",
    "CurrentProductId": "2171",
    "LastArtProId": "5823",
    "profile": "https://dagworld.com/manuparekh.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/manu_parekh_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu026.jpg",
            "title": "Duet of the Doms",
            "year": 2008,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu033.jpg",
            "title": "Image of Goddess",
            "year": 2014,
            "medium": "Iron, enamel and found objects"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu13.jpg",
            "title": "Banaras at Dawn (Triptych)",
            "year": 2005,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu25.jpg",
            "title": "Untitled",
            "year": 1996,
            "medium": "Gouache, dry pastel, charcoal and rice paper pasted on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu0035.jpg",
            "title": "Untitled",
            "year": 1978,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/parekhmanu0049.jpg",
            "title": "Composition",
            "year": 1972,
            "medium": "Oil, charcoal and pastel on canvas"
        }
    ]
}