{
    "name": "Mohan Samant",
    "year": "1924 - 2004",
    "intro": "In the early 1950s,  Mohan Samant was influenced by his teacher Shankar Palsikar, a painter of the traditional school, but moved soon towards an expressionistic mode in an attempt to discover his own style, fusing the expressive, the primitive and the abstract in his art.",
    "bio": "Born in Bombay, Samant showed early proficiency for both music and art. A lifelong player of sarangi—an Indian bowed, string  instrument—Samant chose painting as a career and obtained a diploma from Sir J. J. School of Art, Bombay, in 1952.\nThe development of Samant’s primitivist modernism was accentuated by the unconventional mix of colours, crisp lines, sporadic textures, and figural stylisation. The visual language he adopted stemmed from a confluence of different faiths, ideas and cultures. He was fascinated by early art, especially ancient Egyptian art, and took ideas and elements from Mughal miniatures, Jain manuscript paintings, and tribal and folk symbolism in his work, fusing Hindu mythology and ancient Egyptian wall paintings with modern art. Samant’s relief-like impasto and textures recall the rough surfaces of rocks or weather- beaten walls.\nLike the artists of the Art Brut movement, particularly Jean Dubuffet, he explored the excavated image through fissures and abandoned tracks of paint.\nSamant joined the Progressive Artists’ Group in 1952 and won several prestigious awards throughout his career. In 1959, he went to New York on a John D. Rockefeller III Fund fellowship and stayed there till 1964; four years later he shifted to New York permanently, where he passed away in 2004.",
    "CurrentProductId": "2173",
    "LastArtProId": "3093",
    "profile": "https://dagworld.com/mohansamant.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/o/mohan_samant_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/samantm13.jpg",
            "title": "Abstract #1",
            "year": 1963,
            "medium": "Oil, encaustic, plaster of paris and sand on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/samantm07.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Acrylic, gouache and marker on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/samantm08.jpg",
            "title": "Summer",
            "year": 1952,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/samantm10.jpg",
            "title": "Untitled",
            "year": 1966,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/samantm12.jpg",
            "title": "Black Moon",
            "year": 1961,
            "medium": ""
        }
    ]
}