{
    "name": "Mrinalini Mukherjee",
    "year": "1949 - 2015",
    "intro": "Born in Bombay to eminent artist-couple Benode Behari and Leela Mukherjee, Mrinalini Mukherjee gave a new dimension to modern sculpture in India with works made in natural materials such as woven vegetable fibres of hemp.",
    "bio": "She studied at the Faculty of Fine Arts, M. S. University, Baroda, under artist-teacher K. G. Subramanyan, receiving a post diploma in mural design.\nMukherjee worked with a range of mediums but it was the Fine Arts Fair at Baroda in the early 1970s that influenced her to explore woven sculptures and tapestry. Her painstakingly knotted hemp sculptures, and clay figures, with their twists, curves and overlapping layers, conveyed a feminist message through the body represented in fragments, but also of a lush, fecund world. She referred to her figure as an anthropomorphic deity, but the nature of her reverence was different as she stepped away from the norms of conventional iconography. In 2000, she started working in bronze, bringing the same organically-grown forms to this sturdy material as she did with hemp. She also used ceramic effectively in her work.\nMukherjee received the 1971 British Council scholarship in sculptural art and worked at West Surrey College of Art and Design, Farnham, England. Her works are in the permanent collections of National Gallery of Modern Art, Lalit Kala Akademi, both in New Delhi, and other reputed institutions.\nShe passed away in New Delhi on 2 February 2015 on the eve of her retrospective at National Gallery of Modern Art; this was followed by Met Breuer in New York honouring her with a retrospective in 2019.",
    "CurrentProductId": "2175",
    "LastArtProId": "3110",
    "profile": "https://dagworld.com/mrinalinimukherjee.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/r/mrinalini_mukherjee_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/u/mukherjeemrinalini03.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Ceramic"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/u/mukherjeemrinalini07.jpg",
            "title": "Florescence 2",
            "year": 1996,
            "medium": "Ceramic"
        }
    ]
}