{
    "name": "Thomas Daniell",
    "year": "1749 - 1840",
    "intro": "One of the earliest British artists to arrive in India on a painting expedition, Thomas Daniell is one half of the famous painting duo, the Daniells, the other being his nephew William, with whom he created some of the earliest and most celebrated views of India.",
    "bio": "Thomas Daniell was born to an inn-keeper in Surrey, England, in 1749. He studied painting at the Royal Academy, London, after odd jobs of bricklaying and painting coaches. Although he exhibited 30 works at the academy between 1772 and 1784, Daniell found it difficult to establish himself as a landscape painter in Britain. Like many other Europeans at that time, he was drawn to India by stories of its wealth and possibilities of painting the exotica—chiefly in the wake of the landscapist William Hodges—and in 1784 obtained permission from the East India Company to travel to Calcutta as an engraver, accompanied by his nephew as his assistant.\nThe Daniells arrived in India in 1785 and over the next ten years, travelled extensively, sketching and painting sceneries, people and customs, architecture and ruins, flora and fauna. They travelled across the Himalayas, along the river Ganga, through the mountains and jungles of the south, as well as the Presidency cities of Calcutta and Madras.\nUpon their return to England, the Daniells made several aquatints from the drawings they had amassed, brought together in a collection of one hundred and forty prints issued in six volumes from 1795 to 1808, collectively called Oriental Scenery, a publication that achieved great success. They published aquatints on Calcutta too, titled Views of Calcutta.",
    "CurrentProductId": "2248",
    "LastArtProId": "5489",
    "profile": "https://dagworld.com/thomasdaniell.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thomas_daniell.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/daniellthomas17.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour, charcoal and graphite on paper pasted on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/daniellthomas05.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}