{
    "name": "Thota Vaikuntam",
    "year": "b - 1942",
    "intro": "Born in Karimnagar district in undivided Andhra Pradesh, Thota Vaikuntam is known for powerfully-delineated and brightly-coloured portraits of robust men and women of the Telangana region where he grew up.",
    "bio": "He studied at College of Fine Arts, Hyderabad, from 1965-70, before training under K. G. Subramanyan at M. S. University, Baroda, in 1971-72, on a Lalit Kala Akademi fellowship.\nCalendar art and mythological scenes painted on scrolls and village walls informed his earliest art. His village’s egalitarian social structure, with no marked distinctions of caste or other divisions, has been a lasting inspiration; its rustic beauty and resilient farmers, labourers and women his frequent subjects, engaged in simple, daily activities.\nBright, primary colours evoking nature, rendered in fine brushstrokes, bring to life his sensuously-rendered women and their lustrous dark skin and sturdy bodies that are hardened by labour but also decorated in jewellery and flowers. It is his way of recalling the childhood memory of watching male artistes impersonating female characters for theatre groups in his village. Another source of Vaikuntam’s inspiration is the children’s cultural centre in Hyderabad, Jawahar Bal Bhavan, where he spent fifteen years as an art teacher.\nA celebrated artist, Vaikuntam has also done art direction for films; among others, he was art director for the 1988-89 Telugu film Dasi, which won a national award. In 1993, he received the Lalit Kala Akademi’s national award. Vaikuntam lives and works in Hyderabad.",
    "CurrentProductId": "2361",
    "LastArtProId": "2966",
    "profile": "https://dagworld.com/thota-vaikuntam.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thota_vaikuntham.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vaikuntamt21.jpg",
            "title": "Untitled",
            "year": 1996,
            "medium": "Acrylic on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vaikuntamt22.jpg",
            "title": "Untitled",
            "year": 1999,
            "medium": "Acrylic on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vaikuntamt24.jpg",
            "title": "Untitled",
            "year": 1988,
            "medium": "Waterproof ink and acrylic on paper pasted on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vaikuntamt26.jpg",
            "title": "Untitled",
            "year": 1995,
            "medium": "Acrylic on cardboard"
        }
    ]
}