{
    "name": "Tyeb Mehta",
    "year": "1925 - 2009",
    "intro": "It is ironical that works by Tyeb Mehta, who did not attach much merit to the financial value of art, were the first ones to sell for more than Rs 1 crore by a living Indian artist, and, soon, for more than a million dollars, indicating a beginning of interest in Indian art in the international market.",
    "bio": "His works Celebration, Kali and Mahishasura marked the beginning of the boom in the Indian art market at the start of this century.\nBorn in Kapadvanj in Gujarat in 1925 and brought up in Bombay, Mehta graduated from Sir J. J. School of Art in 1952, by when he was already an associate of the Progressive Artists’ Group founded in 1947. The riots ensuing Partition the same year affected the young artist, appearing in his later works such as Falling Figures. The anguish of the disenfranchised, and the reinterpretation of mythological figures, were his frequent tropes. Referred to sometimes as the Francis Bacon of India, Mehta’s use of primary colours and bold outlines resulted in a language in which opposing forces are represented figuratively, without moral judgement, but symbolic of horror and violence.\nMehta mostly lived in Mumbai except for short stints in London, New York (on a John D. Rockefeller III Fund fellowship), Santiniketan (as artist-in-residence), and New Delhi, each of which brought a significant shift in his art style. Rather less known is his film career—he worked as a film editor in the initial years, and his 1970 short film Koodal won the Filmfare critics award.\nHonoured by the Kalidas Samman in 1988, the Dayawati Modi Foundation award in 2005, and the Padma Bhushan in 2007, Mehta passed away on 2 July 2009 in Mumbai.",
    "CurrentProductId": "2250",
    "LastArtProId": "2971",
    "profile": "https://dagworld.com/tyebmehta.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/y/tyeb_mehta_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/e/mehtat003c.jpg",
            "title": "Diagonal Series",
            "year": 1972,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/e/mehtat013.jpg",
            "title": "Untitled",
            "year": 1985,
            "medium": "Lithograph on paper"
        }
    ]
}