{
    "name": "H. A. Gade",
    "year": "1917 - 2001",
    "intro": "A founder member of the Progressive Artists’ Group, Hari Ambadas Gade was born in Amravati, Maharashtra, in 1917.",
    "bio": "In his own words, he had a ‘compelling interest in science and mathematics’, as a result of which he graduated in science. However, he started making landscapes while on a visit to Jabalpur; subsequently, S. H. Raza guided him on the nuances of landscape painting. Gade eventually obtained a masters from the Nagpur School of Art in 1950.\nIn the corpus of Indian art, Gade stands distinct as a pioneering abstract expressionist and a painter of landscapes of un-peopled houses. He travelled every few months to capture the diverse scenery of India in his work. Gradually, he switched from watercolours—with which he had begun painting landscapes—to oil. His vocabulary also expanded to incorporate the changing landscape of Bombay with its growing slums, unplanned, rambling structures, and eventually veered towards abstraction.\nGade’s urbanscapes are remarkable for their flat, chromatic intensity. The simple geometry of shapes represents a distant view of a densely built area in the city, with the dark heaving lines holding the structure of elemental shapes together. Besides his celebrated abstracts, Gade’s oeuvre covered still-lifes, nudes, portraits, and landscapes.\nHe exhibited widely in India and abroad, including the Venice Biennale in 1954, and was a recipient of several awards such as the gold medal of the Bombay Art Society in 1956, the Maharashtra State Exhibition Award, and an award at the Saigon Biennale in 1962. He passed away in 2001.",
    "CurrentProductId": "2119",
    "LastArtProId": "5857",
    "profile": "https://dagworld.com/h.a.gade.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/ha_gade.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gadeha104.jpg",
            "title": "Horse and Rider",
            "year": null,
            "medium": "Gouache and ink on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gadeha56.jpg",
            "title": "Untitled",
            "year": 1978,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gadeha75.jpg",
            "title": "Untitled",
            "year": 1973,
            "medium": "Oil on canvas"
        }
    ]
}