{
    "name": "Haku Shah",
    "year": "1934 - 2019",
    "intro": "Born on 26 March 1934 in the village of Valod, Gujarat, Haku Shah absorbed deeply the way of life, culture and beliefs of the pastoral and the folk, which he amply manifested in his works.",
    "bio": "Shah's understanding of his environment moulded him into a cultural anthropologist who brought global academic focus on tribal and folk arts and culture of India. He studied for his bachelor’s and master’s degrees in fine arts in the 1950s from M. S. University, Baroda, and was associated with the Baroda Group of Artists that was formed in 1956.\nShah's international breakthrough came in 1967-68, when he spent a year in the U.S. supported by the John D. Rockefeller III Fund, co-curating the exhibition, ‘Unknown India: Ritual Art in Tribe and Village’, with Stella Kramrisch of the Philadelphia Museum of Art. In subsequent years, he would curate several exhibitions in India and abroad on tribal and folk art and rituals, and Indian textiles, writing/co-authoring many related books, such as Rural Craftsmen and Their Work with Dr. Eberhard Fischer in 1970.\nShah’s anthropological endeavours impacted him as an artist, as he revisited tribal art forms and folk themes in his work, repeating images of cows, trees, and human figures with a quiet force. He also painted a series on the poetry of medieval poet-saints like Kabir, Mirabai, and Rai Das.\nIn 1989, he received the Padma Shri and also set up Shilpa Gram in Udaipur for the revival of arts and crafts. He passed away on 21 March 2019, in Ahmedabad.",
    "CurrentProductId": "2120",
    "LastArtProId": "2754",
    "profile": "https://dagworld.com/hakushah.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haku_shah_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shahh13.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shahh15.jpg",
            "title": "Untitled",
            "year": 1962,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shahh17.jpg",
            "title": "Untitled",
            "year": 2006,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shahh18.jpg",
            "title": "The Supreme Consideration is Man",
            "year": 2000,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shahh19.jpg",
            "title": "Pathos",
            "year": 1960,
            "medium": "Oil on canvas"
        }
    ]
}