{
    "name": "Hemen Mazumdar",
    "year": "1894 - 1948",
    "intro": "Hemendranath Mazumdar is remembered for the great artistic success he enjoyed for his academic paintings of sensuous women and portraits of maharajas done in European realist style.",
    "bio": "A notable artist of the rebel Jubilee Art School that trained students in the British academic style, breaking away from Abanindranath Tagore’s Orientalist emphasis, Mazumdar was born on 19 September 1894 to a landowning family in Kishoreganj in present day Bangladesh. He studied art against his father’s wishes and went on to become the most sought-after artist for oil portraits after Raja Ravi Varma.\nIn 1920, along with Atul Bose and Jamini Roy, Mazumdar founded the influential illustrated journal, Indian Academy of Art, as a platform for academic artists from all over India, and to counteract the dominance of Bengal School journal, Rupam. Though Roy soon moved away from academic realism, and Bose left for England, Mazumdar’s career took off. He went on to win three gold medals from the respected Bombay Art Society.\nHis large oils of women in the nude or draped in diaphanous clothes, bearing an air of voyeuristic eroticism, won him several commissions from the maharajas of Jaipur, Bikaner, Kashmir, Patiala, and other princely states. Most commonly, a single woman is seen in these works in wet drapery and idealised romantic settings, emphasising her sensuous appeal.\nAt the All India Exhibition in Calcutta in 1948, the last show he participated in, Mazumdar presented rural Bengal life in his works with amazing realism, a far cry from his earlier work. He passed away on 22 July that year.",
    "CurrentProductId": "2123",
    "LastArtProId": "2781",
    "profile": "https://dagworld.com/hemenmazumdar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hemen_majumdar.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mazumdarh011.jpg",
            "title": "Study of a Young Nude",
            "year": 1945,
            "medium": "Conte on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mazumdarh014.jpg",
            "title": "Untitled (A Dry Feast)",
            "year": null,
            "medium": "Watercolour on paper pasted on board"
        }
    ]
}