{
    "name": "Himmat Shah",
    "year": "b - 1933",
    "intro": "Born in Lothal in Gujarat, one of the most important sites of the Harappan civilisation (3300-1300 BCE), Himmat Shah’s long-term engagement with terracotta traces its roots to the ancient antecedents of his birthplace, seen especially in his sculptural Heads.",
    "bio": "As a young boy, Shah studied in Bhavnagar at Gharshala—a school associated with nationalist renaissance in Gujarat—where he was initiated into arts by artist-educator Jagubhai Shah. Going against the grain of his Jain mercantile family, he studied at Sir J. J. School of Art, Bombay, and then at M. S. University, Baroda (1956-60). He went to Paris in 1967 for two years on a French government scholarship, studying under printmakers S. W. Hayter and Krishna Reddy at Atelier 17. This sojourn helped him interact with European modernism.\nA versatile artist, Shah has experimented across forms and mediums, making burnt paper collages, architectural murals, drawings, and sculptures in terracotta and bronze, though he sees himself primarily as a sculptor. His self-designed tools and innovative techniques give his preferred medium—terracotta—a contemporary edge. Shah uses a number of hand tools, brushes and instruments to carve, shape and mould his works. He has designed and executed monumental murals in brick, cement, and concrete.\nA founder member of Group 1890, Shah won the Lalit Kala Akademi’s national award in 1956 and 1962, the Sahitya Kala Parishad award in 1988, and the Kalidasa Samman from the Madhya Pradesh government in 2003. He lives and works in Jaipur.",
    "CurrentProductId": "2124",
    "LastArtProId": "5797",
    "profile": "https://dagworld.com/himmatshah.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmat_shah_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats549.jpg",
            "title": "Untitled",
            "year": 1977,
            "medium": "Colour etching on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats634ny_1.jpg",
            "title": "Untitled (Head)",
            "year": 1986,
            "medium": "Painted terracotta and metal"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats637ny.jpg",
            "title": "Untitled",
            "year": 1999,
            "medium": "Terracotta"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats639ny_1.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Painted terracotta"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats649_1.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Terracotta with gold leaf, gold paint and artist's photograph with wooden base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/i/himmats648ny.jpg",
            "title": "Untitled",
            "year": 1962,
            "medium": "Enamel, pastel, graphite and burn marks on paper pasted on paper"
        }
    ]
}