{
    "name": "Hugo Vilfred Pedersen",
    "year": "1870 - 1959",
    "intro": "Danish artist Hugo Vilfred Pedersen was born on 25 January 1870 in Copenhagen, where he studied at the Royal Academy of Fine Arts before heading to the East on painting expeditions.",
    "bio": "Pedersen spent about twenty years travelling through Indonesia, Malaysia, Singapore, Thailand, Sri Lanka and India, making copious paintings of the sights that he saw, and portraits of the important personages he met.\nPedersen’s older brother worked on a tobacco plantation in Sumatra, where he first arrived in 1898, travelling further to Penang, Java, and Siam. He painted many portraits of native subjects, which he clearly found interesting. These included a portrait of the ruler of Surakarta in Java, in whose palace Pedersen worked briefly, thanks to an introduction by the Dutch governor general of the colony. This portrait was subsequently presented as a token of the ruler’s loyalty to the Queen of the Netherlands; it continues to be a part of the Royal Dutch Collection.\nPedersen especially sought out the ordinary folk, painting portraits of liveried servants, guards and other support staff of the colonial empire who often lived in total obscurity. One such striking portrait is that of a Sikh bodyguard in the service of the Maharajah of Burdwan. Pedersen also painted a portrait of India’s Viceroy of the time, Lord Curzon, in 1903, which perhaps attests to his presence at the Delhi Durbar the same year.\nEight of Pedersen’s paintings were published in 1926 in Peeps at Many Lands, edited by J. F. Scheltema. The artist passed away on 4 May 1959.",
    "CurrentProductId": "5465",
    "LastArtProId": "5574",
    "profile": "https://dagworld.com/hugo-vilfred-pedersen.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/u/hugo_pedersen.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv0012.jpg",
            "title": "Rauchende Orientalin (Smoking Oriental)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv009.jpg",
            "title": "Amer Fort",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv007.jpg",
            "title": "Gate of the Arab Sarai in Delhi",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv006.jpg",
            "title": "Krishna Raja Wadiyar IV, Maharaja of Mysore",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv005.jpg",
            "title": "Delhi",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pedersenhv003.jpg",
            "title": "Entrance to the Jagat Shiromani Temple in Amer, Rajasthan",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}