{
    "name": "C. Douglas",
    "year": "b - 1951",
    "intro": "Born in Tellicherry, Kerala, Catfield Douglas belongs to the third generation of artists associated with the Madras Art Movement.",
    "bio": "Moving in the early 1990s to Cholamandal Artists’ Village, set up by K. C. S. Paniker, Douglas came to be known for his works that were considered both expressionist and anthropocentric.\nGraduating from the Government College of Art and Craft, Madras, in the ’70s, Douglas’s art evolved as a process of deep introspection, influenced by both the narrative and the fantastical elements in the art of the master artists that he’d encountered in his college and on his trips abroad. In the ’80s, in Germany, where he’d moved after getting married to a theatre artiste he met at Max Mueller Bhavan in Madras, he experienced closer interaction with expressionism and Bauhaus.\nBelieving that ‘art is about wounds’, Douglas, in the course of his prolific artistic career, has experimented with various mediums, particularly paper, testing its texture by crumpling, burning, even bathing it several times in water to make it more malleable.\nDouglas has received several awards and grants in the course of his career, including the national award from the Lalit Kala Akademi, New Delhi, in 1992. In 1991-93 and 1994-96 he received cultural fellowships from the Government of India. In 1994, he was awarded the Charles Wallace Grant to study ceramics in the Netherlands.\nHe continues to live and work in Cholamandal Artists’ Village, Chennai.",
    "CurrentProductId": "2093",
    "LastArtProId": "2567",
    "profile": "https://dagworld.com/c.douglas.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/_/c_douglas.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/o/douglasc001.jpg",
            "title": "Dark Mirror (Triptych)",
            "year": 2005,
            "medium": "Acrylic, sand and ochre on paper pasted on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/o/douglasc024.jpg",
            "title": "Untitled (Bell Series)",
            "year": 2005,
            "medium": "Mixed media on paper pasted on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/o/douglasc025.jpg",
            "title": "Absence",
            "year": 2006,
            "medium": "Charcoal, pastel, chalk, acrylic and mud on wood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/o/douglasc35.jpg",
            "title": "Untitled",
            "year": 2005,
            "medium": "Ink and coffee on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/o/douglasc046.jpg",
            "title": "Untitled",
            "year": 1975,
            "medium": "Mixed media on fabric pasted on Masonite board"
        }
    ]
}