{
    "name": "A. Ramachandran",
    "year": "b - 1935",
    "intro": "Achutan Ramachandran Nair, popularly known as A. Ramachandran, was born in 1935 in Attingal, Kerala.",
    "bio": "He studied Malayalam literature before pursuing art at Kala Bhavana, Visva-Bharati University, Santiniketan. Under the tutelage of Nandalal Bose and Ramkinkar Baij, he developed both the muralist’s monumentality of scale and the intimate ambit of the miniaturist.\nRamachandran devoted the first half of his career to the exploration of the modern man in his urban environment, before reversing that trajectory to a celebration of life in rural India—focussed on a community of Bhil tribals living near Udaipur, Rajasthan. As a result of this, his works encompass a mammoth range—from the depiction of Kerala’s socio-political situation through dark and tortured images in the early years, to classical art replete with decorative elements, motifs and exuberant colour, followed by an altogether seductive form, featuring women, birds, and beasts, in later years.\nRamachandran has also been an art teacher, and was associated with children’s literature, writing and illustrating fifty picture books between 1961 and ’92 that were published in India and abroad, most prominently in Japan. Some of these original illustrations are on permanent display at the Museum of Children’s Books in Miyazaki, Japan. He has conducted workshops on children’s book illustrations in many countries for U.N.E.S.C.O.\nRamachandran became the chairman of the Kerala Lalit Kala Akademi in 1993 and has been honoured with several awards, including the Padma Bhushan in 2005. He lives and works in New Delhi.",
    "CurrentProductId": "2055",
    "LastArtProId": "2385",
    "profile": "https://dagworld.com/a.ramachandran.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/_/a_ramachandran_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ramachandran47.jpg",
            "title": "Nature I",
            "year": 1989,
            "medium": "Ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ramachandran56.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ramachandran70.jpg",
            "title": "Kaleidoscope",
            "year": 1966,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ramachandran74.jpg",
            "title": "Gestures (Triptych)",
            "year": 1966,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ramachandran78.jpg",
            "title": "Untitled",
            "year": 1968,
            "medium": "Etching on paper"
        }
    ]
}