{
    "name": "Amalnath Chakladhar",
    "year": "b - 1936",
    "intro": "Amalnath Chakladhar belongs to that category of Bengali modernists who carved an identity uniquely their own, despite the overarching influence of the three prominent strains of modern art in Bengal in the first half of the twentieth century—the Bengal School, academic training in art schools of Calcutta, and expressionism in Santiniketan.",
    "bio": "His contribution to furthering modernism in India assumes importance for being a seminal, individual effort. Born in present-day Bangladesh, Chakladhar graduated from the Government College of Arts and Crafts, Calcutta, in 1960. In his long career as an artist, nature has dominated his art—flowing water, swaying breeze, the softness of grass and petals, all captured beautifully by the artist with his brilliant mastery over form and technique.\nHis small, descriptive works reveal minute details, demonstrating the attention of his controlled brushwork. To give an example of his observation rendered delicately on paper, his Untitled watercolour depicting a Baul performance in a village haat (market) in Birbhum in Bengal can be quoted, which leaves one marvelling at the minutest of details he captures. He has worked across mediums and techniques, choosing to paint his acute observations of nature and life around him over subjects from Indian classics and mythology.\nChakladhar has participated in important exhibitions such as the centenary celebration of the Sepoy Mutiny in 1957, and the 1992 Hyderabad exhibition, 'Bengal Art Today'. He taught at his alma mater for several years, and has won many awards, including the prestigious. Rajya Charukala Pradarshani award from the Government of West Bengal in 1987. He is based in Kolkata.",
    "CurrentProductId": "2063",
    "LastArtProId": "2426",
    "profile": "https://dagworld.com/amalnathchakladar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/m/amalnath_chakladhar.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chakladhara30.jpg",
            "title": "Untitled",
            "year": 1967,
            "medium": "Tempera on paper pasted on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chakladhara44ny_1.jpg",
            "title": "Untitled (Saithiya Baul Sampradaya, Birbhum)",
            "year": null,
            "medium": "Watercolour and gouache on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chakladhara46.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil and tempera on fabric pasted on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chakladhara49_1.jpg",
            "title": "The Abode",
            "year": 1973,
            "medium": "Tempera on fabric pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chakladhara51_1.jpg",
            "title": "Street Juggler",
            "year": 1958,
            "medium": "Lithograph on paper pasted on paper"
        }
    ]
}