{
    "name": "Amar Nath Sehgal",
    "year": "1922 - 2007",
    "intro": "Modernist sculptor Amar Nath Sehgal was one of the earliest Indian artists to take legal action under the Indian Copyright Act defending his moral right over his work.",
    "bio": "In 1957, Sehgal created a mural for Vigyan Bhavan, New Delhi, on a government commission, which was pulled down without his permission or any intimation in 1979. Sehgal went to court and won the lawsuit.\nBorn on 5 February 1922, in Campbellpur (now known as Attock, in Pakistan), Sehgal was educated in Lahore. Though interested in the arts, he obtained a degree in industrial chemistry and physics. Eventually, he went to study art at the New York University in 1948.\nSehgal returned to India after three years and worked as an arts consultant with the government for reviving folk arts. He quit the job in 1966 and moved to Europe, travelling and working as a practising artist. He participated in several exhibitions across Europe, eventually opening a studio in Luxembourg in 1979. Thereafter, he divided his time between India and Luxembourg.\nA versatile artist, Sehgal worked across mediums—paintings, tapestries, graphic arts, even writing poetry—but earned renown as a sculptor. Early exposure to trends in Western art through his travels informed his oeuvre as much as his heritage, chiselled through long years of work with folk artists. Awarded the prestigious Lalit Kala Akademi fellowship in 1993, he passed away in 2007 and was posthumously awarded the Padma Bhushan by the Government of India in 2008.",
    "CurrentProductId": "2340",
    "LastArtProId": "2429",
    "profile": "https://dagworld.com/amar-nath-sehgal.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/m/amar_nath_sehgal.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sehgalan0001c.jpg",
            "title": "Cynic",
            "year": 1962,
            "medium": "Bronze with marble base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sehgalan0002c.jpg",
            "title": "Lovers",
            "year": 1980,
            "medium": "Bronze with bronze base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sehgalan0003c.jpg",
            "title": "Ballerina",
            "year": 1995,
            "medium": "Bronze with marble base"
        }
    ]
}