{
    "name": "Anonymous (Ravi Varma School)",
    "year": "Late 19th Century - Early 20th Century",
    "intro": "Raja Ravi Varma’s singular impact on Indian art is unparalleled by any artist. Largely self-taught, he is probably the first Indian artist to have articulated Indian subject matters through naturalism and the use of oil paints with brilliant mastery, considered until then a European idiom.",
    "bio": "Varma’s forte was oil portraits of royalty, the sensuous depiction of women engaged in everyday activity, and vignettes from mythology and religious epics. His renditions of Hindu iconography and female mythological characters such as Sita, Shakuntala, Damayanti and Draupadi soon became extremely popular through their oleographs and calendars available in the market. So popular was Varma’s art that it soon drew followers among several Indian artists, a number of them anonymous but painting in a style so strongly influenced by Varma’s painting, that their art came to be known by the generic term Ravi Varma School.\nAmong the recognised Indian artists to paint in his mould were Hemendranath Majumdar (1894-1948), whose large oils of partially clothed or nude women with their air of voyeuristic eroticism attracted royal patronage, and Satish Chandra (1893-1965), whose gracefully modelled bodies feature in works with classical and romantic themes.",
    "CurrentProductId": "2342",
    "LastArtProId": "2467",
    "profile": "https://dagworld.com/anonymous-ravi-varma-school.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/n/anonymous_portrait_.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/n/anonymous290.jpg",
            "title": "Untitled (Saraswati)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/n/anonymous297.jpg",
            "title": "Untitled (Apsara)",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}