{
    "name": "Arpita Singh",
    "year": "b - 1937",
    "intro": "An influential artist who is known for her richly detailed oils and watercolours, Arpita Singh was born in Calcutta in 1937.",
    "bio": "She studied art at Delhi Polytechnic (now College of Art) from 1954-59, and then joined the Government of India’s cottage industries restoration programme in 1959, which allowed her to meet weavers and artisans.\nHer work in the 1970s would reflect this in the form of expressive black and white abstracts. By the ’80s, she was seeking influence for her watercolours from Bengali folk paintings with women going about their daily tasks as her subject. In the ’90s, she shifted dramatically to oil on canvas. Her work became more detailed, though the central figure remained the woman and her domestic preoccupations; women continue to play a major role in the transmission of memories in Singh's works. \nSingh treats the pictorial space like a postcard and fills it up with images in a throwback to her childhood. Her first solo exhibition was held in 1972, in New Delhi, at the Kunika Chemould Gallery, organised by Roshan Alkazi. She went on to have exhibitions at prestigious international venues such as the Royal Academy of Arts, London, Centre Georges Pompidou, Paris, and other galleries in Switzerland and Australia. She has won several awards, including the Parishad Samman from the Sahitya Kala Parishad, New Delhi, in 1991, and the Padma Shri from the Government of India in 2011. \nShe lives and works in New Delhi with her artist husband Paramjit Singh.\nSingh treats the pictorial space like a postcard and fills it up with images in a throwback to her childhood. Her first solo exhibition was held in 1972, in New Delhi, at the Kunika Chemould Gallery, organised by Roshan Alkazi. She went on to have exhibitions at prestigious international venues such as the Royal Academy of Arts, London, Centre Georges Pompidou, Paris, and other galleries in Switzerland and Australia. She has won several awards, including the Parishad Samman from the Sahitya Kala Parishad, New Delhi, in 1991, and the Padma Shri from the Government of India in 2011.\nShe lives and works in New Delhi with her artist husband Paramjit Singh.",
    "CurrentProductId": "2343",
    "LastArtProId": "2471",
    "profile": "https://dagworld.com/arpita-singh.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/r/arpita_singh_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/r/arpitasingh10.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Ink on paper"
        }
    ]
}