{
    "name": "Jaya Ganguly",
    "year": "b - 1958",
    "intro": "Jaya Ganguly is known for turning the concept of aesthetics on its head while portraying social hypocrisies through her paintings.",
    "bio": "However, it’s not just the duplicity of the privileged vis-à-vis the have-nots that she seeks to express, but also the pretenses that the former keep up with in their comfortable yet orthodox existence.\nBorn on 3 October 1958 in Calcutta, Ganguly graduated from the city’s Indian College of Arts and Draftsmanship in 1982. She fills her paintings with voluminous figures, rendered with broad brushstrokes in a spectrum of colours. Painted against monochromatic backgrounds, her figures of men and women from a thriving social milieu are often repulsive—their distortions alluding to the burden of repression they carry on their shoulders yet are comfortable with due to years of internalisation.\nBy stripping them of an idealised veneer of beauty, Ganguly not only dissents against the conventional norms of portraying women in art but also makes them real and relatable. For instance, her mixed media work titled The Kiss is a take on the eponymous and famous work of Gustav Klimt, which was a shimmering ode to the first flush of passion. Though her work is often bracketed as feminist, it is more a chronicle of reality from a woman’s point of view than an activist’s focus on the condition of women.\nThe Kolkata-based artist has been the recipient of several awards—from the Indian College of Arts and Draftsmanship, Kolkata, (1980), by Bhopal Biennale (1996), and the Birla Academy of Art and Culture, Kolkata (1997).",
    "CurrentProductId": "2134",
    "LastArtProId": "3183",
    "profile": "https://dagworld.com/jayaganguly.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/a/jaya_ganguly.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj002.jpg",
            "title": "Four Figures",
            "year": 1982,
            "medium": "Chinese ink and watercolour on paper pasted on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj026.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Waterproof ink and ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj065.jpg",
            "title": "Untitled",
            "year": 1991,
            "medium": "Oil, acrylic and adhesive on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj177.jpg",
            "title": "Untitled",
            "year": 2006,
            "medium": "Acrylic, charcoal and pastel on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj183.jpg",
            "title": "Untitled",
            "year": 2006,
            "medium": "Ink on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gangulyj202.jpg",
            "title": "Untitled",
            "year": 2006,
            "medium": "Acrylic and pastel on canvas"
        }
    ]
}