{
    "name": "Jehangir Sabavala",
    "year": "1922 - 2011",
    "intro": "A painter with a strikingly elegant bearing, Jehangir Sabavala was born on 23 August 1922 in an affluent Parsi family in Bombay and grew up in an intellectually charged environment.",
    "bio": "Sabavala studied at Elphinstone College, Bombay, before graduating from Sir J. J. School of Art in 1944. Thereafter, he studied at some of the leading art schools of Europe—The Heatherly School of Art, London (1945-47), Académie André Lhote, Paris (1948-51), Académie Julian, Paris (1953-54), and Académie de la Grande Chaumière, Paris (1957).\nSabavala came to be known for his unique style that comprised a mix of academic, impressionistic, and cubist elements, almost always executed in his preferred muted oil colours. Beginning with portraits and still-lifes in the early years of his career, Sabavala started exploring different styles to soon arrive at his signature vocabulary. He introduced a sense or serenity and depth to his cubist landscapes through receding geometric planes. In the later years, his works incorporated his response to epochal current issues.\nSabavala’s works are part of important collections such as the National Gallery of South Australia, Adelaide; Burmah Shell, London; Air India, Mumbai; and the National Gallery of Modern Art, New Delhi. He received the Padma Shri from the Government of India in 1977, and All India Fine Arts and Crafts Society’s Kala Ratna award in 2001. Arun Khopkar’s film on his life, Colours of Absence, won a national award in 1994.\nSabavala passed away in Mumbai on 2 September 2011.",
    "CurrentProductId": "2135",
    "LastArtProId": "3173",
    "profile": "https://dagworld.com/jehangirsabavala.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/e/jehangir_sabavala_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sabavalajehangir19.jpg",
            "title": "Untitled",
            "year": 1991,
            "medium": "Graphite on newsprint paper"
        }
    ]
}