{
    "name": "Jitish Kallat",
    "year": "b - 1974",
    "intro": "Born in Bombay, Jitish Kallat’s earliest memory of art was of helping his elder sister as a five-year-old for a drawing in her biology book. By the time he was in his mid-teens, he was, in his own words, ‘persistently and obsessively drawing’.",
    "bio": "Kallat secured a degree in fine arts in 1996 from Sir J. J. School of Art. An internationally acclaimed artist, his work includes painting, photography, collages, sculpture, installations, and multimedia.\nHis works have been exhibited widely in museums and institutions across the world, including Tate Modern (London), Martin-Gropius-Bau (Berlin), Mori Art Museum (Tokyo), Gallery of Modern Art (Brisbane), and the Institut Valencia d’Art Modern (Spain), among several others. He was the curator of Kochi-Muziris Biennale, one of the largest contemporary art events of its kind in India and the second-largest running Biennale in the world after the Venice Biennale, in 2014.\nKallat was twenty-two years old when he had his first solo exhibition titled ‘P.T.O.’ in Mumbai. While his art has undergone significant changes, ‘…the ideas of time, sustenance, birth, death and mortality… still continue to preoccupy me.’ Referencing both, Asian and European artistic traditions along with popular advertising imagery that fuels urban consumerism, Kallat’s work is layered and replete with metaphor.\nA significant contemporary artist, Kallat’s work has been exhibited at numerous biennales and triennales, including those in Havana, Gwangju, and Kiev.  In 2017, National Gallery of Modern Art, New Delhi, organised his retrospective, titled ‘Here After Here’, examining his work from 1992 to 2017.",
    "CurrentProductId": "2137",
    "LastArtProId": "3170",
    "profile": "https://dagworld.com/jitishkallat.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/i/jitish_kallat.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kallatjitesh05.jpg",
            "title": "Detergent / Triptych",
            "year": 2003,
            "medium": "Acrylic, enamel, marble dust and marker on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kallatjitish07ny.jpg",
            "title": "Humiliation Tax-II",
            "year": null,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kallatjitish08.jpg",
            "title": "Yawn Garden IV",
            "year": 2000,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kallatjitish09.jpg",
            "title": "Humiliation Tax",
            "year": 2005,
            "medium": "Acrylic on canvas"
        }
    ]
}