{
    "name": "Jogesh Chandra Seal",
    "year": "1895 - 1926",
    "intro": "Jogesh Chandra Seal was an active member of the enthusiastic art scene of Calcutta in early twentieth century but due to his short life of thirty-one years, he could not leave behind a comprehensive body of work.",
    "bio": "Seal's academic oil paintings, Untitled (Disappointed), 1919, and Lady Lighting a Diya, 1921, have recently appeared at international auctions, bringing spotlight on this accomplished artist who was closely associated with the values of the Bengal School of painting.\nAlong with Hemendranath Mazumdar and Atul Bose, Seal studied at the Jubilee Art Academy in Calcutta, an institution established in 1896 by Ranada Prasad Gupta with the help of the Calcutta Corporation to depart from the artistic norms set by the Government School of Art. In search of a new visual language, Seal drew his inspiration from indigenous sources, depicting mostly Bengali women in rural setting, bearing the influence of his classmate Hemendranath Mazumdar.\nSeal’s preferred medium was oil. Though following the canons of academic realism, Seal rendered some of his figures in the format of Indian miniature paintings.\nSeal’s close association with like-minded artists such as Nirode Majumdar, Jamini Roy, B. C. Law, and Atul Bose—all trained in the Western academic style— led, in 1919, to the establishment of the Indian Academy of Fine Arts in Calcutta. In 1921, Atul Bose and Seal founded the Society of Fine Arts. Seal’s paintings were appreciated during his lifetime and were collected by Sir Rajendra Prasad Mukhopadhyay and the king of Burdwan.",
    "CurrentProductId": "2353",
    "LastArtProId": "5917",
    "profile": "https://dagworld.com/jogesh-chandra-seal.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/c/jc_seal.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sealjc05.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sealjc04.jpg",
            "title": "Untitled",
            "year": 1921,
            "medium": "Oil on canvas"
        }
    ]
}