{
    "name": "Jogen Chowdhury",
    "year": "b - 1939",
    "intro": "Born on 15 February 1939 in Faridpur (now in Bangladesh), Jogen Chowdhury’s family moved to Calcutta following the Partition.",
    "bio": "Chowdhury studied art at the Government College of Art and Crafts, Calcutta, and subsequently at École Nationale Supérieure des Beaux-Arts, Paris. A student of Prodosh Das Gupta, Chowdhury worked in the expressionist style of figuration in his early years. He created his own gallery of the grotesque, featuring lewd men with bellies like sacks and women with loose, hanging breasts. The Paris sojourn sharpened his creative thought process, helping in the evolution of his distinctive personal style.\nChowdhury interprets the human form through the x-ray vision of his creativity: attenuated, exaggerated, fragmented, reconfigured, and rephrased. For Chowdhury, the body has to communicate in silence. Often placing his figures against a vacant background, he does not appropriate the specificity of place or environment; instead, he transfers feelings of anguish on to his figures through gestural mark-making. His dense, crosshatched lines simulate body hair and a web of veins takes away the smooth sensuality of the classical body to manifest the textures of life.\nChowdhury believes art in India is neither subsumed in the miniature traditions nor in those of Ajanta, for India is neither a monolith nor a static entity; and that a notion of Indianness should not be fixed into some kind of timeless loop. He has been awarded the Madhya Pradesh government’s Kalidas Samman, and was honoured at the 2nd Havana Biennale. He lives and works in Kolkata and Santiniketan.",
    "CurrentProductId": "2138",
    "LastArtProId": "4104",
    "profile": "https://dagworld.com/jogenchowdhury.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/j/o/jogen_chowdhury_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj103_1_.jpg",
            "title": "Untitled",
            "year": 1961,
            "medium": "Charcoal on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj113ny.jpg",
            "title": "Untitled (Woman with Yellow Hair)",
            "year": 1993,
            "medium": "Ink and pastel on paper mounted on card"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj117_1.jpg",
            "title": "Still Life with Fruits - II",
            "year": 2001,
            "medium": "Oil pastel and ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj122_1.jpg",
            "title": "Reclining Woman",
            "year": 2007,
            "medium": "Dry pastel and charcoal on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj123_1.jpg",
            "title": "Animal",
            "year": 2009,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhuryj125_1.jpg",
            "title": "Untitled",
            "year": 1997,
            "medium": "Charcoal and pastel on paper"
        }
    ]
}