{
    "name": "Radha Charan Bagchi",
    "year": "1910 - 1977",
    "intro": "Radha Charan Bagchi worked in both tempera and oil, switching from one to the other with equal ease; and also worked with the graphic mediums of drypoint, etching, lithography, and linocut.",
    "bio": "Born in 1910 in Pabna, in present-day Bangladesh, he graduated from College of Arts and Crafts, Calcutta, in traditional Indian art, oil painting, and Western academism. Abanindranath Tagore, Mukul Dey and other Bengal masters were major influences but Bagchi evolved his own artistic style. In 1951, he joined Kala Bhavana, Santiniketan, as teacher, officiating twice as its principal in subsequent years.\nKnown for his miniatures, Bagchi’s paintings on the fall of the Mughal empire depict its pathos. Hindu and Buddhist mythology featured prominently in his work, and he illustrated the Hindu epics Ramayana and Mahabharata, and the Buddhist Jataka tales, in miniature style. He also painted episodes from the works of the classical Sanskrit playwright Kalidasa, such as Kumarasambhavam, Meghadootam and Abhijnanashakuntalam.\nBagchi also did numerous oil portraits in which he applied Western concepts and techniques, though a strong Indian sensibility comes through in them. He received several awards in his career, including the President’s medal for best exhibitor’s prize at his alma mater, the President’s gold and silver plaque at the All India Exhibition of Paintings, Madras, 1958, and a gold medal at the All India Exhibition, Patna, for traditional Indian paintings. He was commissioned by Visva-Bharati, Santiniketan, to paint a life-size oil of Rabindranath Tagore and his family in 1961.",
    "CurrentProductId": "2205",
    "LastArtProId": "2724",
    "profile": "https://dagworld.com/radhacharanbagchi.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/radha_charan_bagchi.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir078.jpg",
            "title": "Darjeeling",
            "year": 1957,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir087.jpg",
            "title": "Santal Boy",
            "year": 1956,
            "medium": "Oil on canvas pasted on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir47.jpg",
            "title": "Nadira Banu ki Maut",
            "year": null,
            "medium": "Tempera highlighted with gold pigment on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir55.jpg",
            "title": "Kalighat Market",
            "year": 1937,
            "medium": "Lithograph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir68.jpg",
            "title": "Flames of the Forest",
            "year": 1952,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bagchir075ny.jpg",
            "title": "Bahadur Shah Ke Akhri Ayyam (The Last Days of Bahadur Shah Zafar)",
            "year": null,
            "medium": "Gouache on paper"
        }
    ]
}