{
    "name": "Ram Kumar",
    "year": "1924 - 2018",
    "intro": "Though Ram Kumar created figurative works in his early years, he came to be known for his unique style of abstraction, a genre that he turned to, while in Varanasi, where he had gone to paint with friend and fellow artist M. F. Husain.",
    "bio": "Born in Simla on 23 September 1924, Ram Kumar studied for his master’s in economics at St. Stephen’s College, Delhi University. While at college, Kumar attended evening classes at Sarada Ukil School of Art, where he learnt the ‘Western style’ of painting under Sailoz Mookherjea.\nHis unpeopled, abstract landscapes are devoid of the usual constituents of reality, only suggesting land, trees, sky, and water, through the intensity of colours.\nLike several first-generation, post-colonial Indian artists, such as F. N. Souza, S. H. Raza, Akbar Padamsee, and Paritosh Sen, Ram Kumar combined a desire for global success with the need to belong emphatically to his homeland. In 1950, he left for Paris to study under André Lhote and Fernand Léger, where he became part of the communist circle of intelligentsia, attending meetings and demonstrations. Upon his return to India, he regularly exhibited with Delhi Silpi Chakra, becoming by the mid-1950s one of India’s emerging young painters. He received the Lalit Kala Akademi’s national award in 1956 and 1958, and the Government of India’s Padma Shri in 1971. In addition to being a visual artist of repute, Kumar was also a prolific writer in Hindi.\nOne of India’s foremost modernists, Kumar passed away on 14 April 2018.",
    "CurrentProductId": "2208",
    "LastArtProId": "4366",
    "profile": "https://dagworld.com/ramkumar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ram_kumar_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/u/kumarr40.jpg",
            "title": "Untitled",
            "year": 1965,
            "medium": "Ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/u/kumarr71.jpg",
            "title": "Untitled (Two Sisters)",
            "year": 1958,
            "medium": "Lithograph on paper"
        }
    ]
}