{
    "name": "Rameshwar Broota",
    "year": "b - 1941",
    "intro": "Experimenting across styles,  Rameshwar Broota’s artistic concerns have evolved around crass materialism in society and the juxtaposition of the primitive man.",
    "bio": "A graduate of Delhi College of Art, he has been an art teacher throughout his career. He was a lecturer at his alma mater before moving to Jamia Millia Islamia University and then Sarda Ukil College, eventually taking over as head of department at Triveni Kala Sangam, a position he has held since 1984.\nStarting as a representational painter, Broota dabbled in abstraction before returning to the figurative style. His visual language bears elements of realism and expressionism.Allegorical, grotesque, satiric representations manifested in his Ape series of the 1970s in which he critiqued the corruption and decadence among the elite. Later, Broota moved to the realm of the timeless, exploring the opposing pulls of matter and spirit.\nThe leitmotif of Broota’s imagery in his series Man, Faces and Scripted in Time is the ‘man’ who, collectively, represents mankind. His paintings of the male nude have arisen from the suggestion of strength and force as symbolised by the masculine torso. Browns, greys, blues, whites, and metallic tones of gold, silver, and copper, dominate these works.\nIn the ’70s, Broota invented his scratching technique involving scratching through layers of paint with blades. The result is a powerful depiction of sometimes inimical forces—the human body juxtaposed against architecture, for instance—that have marked him as a painter of major significance. His experimentation with cinematographic language resulted in video art films in the mid-’80s, and his recent interest in photography has been critically acclaimed. The artist lives and works in New Delhi.",
    "CurrentProductId": "2210",
    "LastArtProId": "2741",
    "profile": "https://dagworld.com/rameshwarbroota.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/rameshwar_broota_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/r/brootar12.jpg",
            "title": "Untitled",
            "year": 1964,
            "medium": "Oil, plaster of Paris and metal on canvas (Relief Work)"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/r/brootar13.jpg",
            "title": "Praveen",
            "year": 1964,
            "medium": "Oil on canvas"
        }
    ]
}