{
    "name": "Ranbir Singh Kaleka",
    "year": "b - 1953",
    "intro": "Often erotic and libidinous, Ranbir Kaleka's works present themselves to the viewer, who might project their sub-conscience, in a way that already accounts for subverting any possibility of ambiguity on a subjective level.",
    "bio": "Born in Patiala, Punjab, in 1953, Ranbir Kaleka earned a diploma in painting from Punjab University’s College of Art in Chandigarh. He spent the next few years teaching at Punjab University and College of Art, New Delhi, before leaving for London on a Charles Wallace scholarship to study at Royal College of Art from 1985-87. He stayed on in London for several years and returned to India in the late 1990s.\nOften termed surrealistic, Kaleka’s works usually follow a dream-logic, refraining from coherent narratives. Though his earlier works from the ’70s seemed more internalised, weaving together apparently unrelated, fantastic elements, his later works remain open ended and in communication with the viewer, making their viewing an interactive experience. The libidinal element in his works remains masculine and primal, framed by phantasmal animal motifs.\nIn the later years, Kaleka found expression in video art, projecting video onto painted canvases. Here, too, the works attempt to draw the viewer into the narrative, such as in Powder Room (1999-2000), which uses a reflective surface. His video work, Man with Cockerel, was chosen for the group show ‘Indian Narrative in the 21st Century: Between Memory and History’, at Casa Asia, Madrid and Barcelona, Spain, presented in collaboration with the Walsh Gallery. The artist lives and works in New Delhi.",
    "CurrentProductId": "2213",
    "LastArtProId": "2765",
    "profile": "https://dagworld.com/ranbirkaleka.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/ranbir_kaleka_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kalekaranbirsingh06.jpg",
            "title": "Tossing a Bull",
            "year": 1993,
            "medium": "Watercolour and sketch pen highlighted with gold and silver pigment on paper and corrugated board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kalekaranbirsingh07.jpg",
            "title": "Woman Wrestling with a Lion",
            "year": null,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kalekaranbirsingh10.jpg",
            "title": "A Shoe and a Hoof",
            "year": 1992,
            "medium": "Watercolour and pencil colour highlighted with gold and silver pigment on paper and corrugated board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kalekaranbirsingh17.jpg",
            "title": "Marking the Frame: The Secret History of Shape Shifters, What Belongs in Which Hand?",
            "year": 2014,
            "medium": "Digital collage-painting in archival inks and oils on canvas"
        }
    ]
}