{
    "name": "Rekha Rodwittiya",
    "year": "b - 1958",
    "intro": "Born on 31 October 1958 in Bangalore, Rekha Rodwittiya is an artist aligned with the Baroda School whose work engages with gender politics, socio-political subjugation, human degradation, violence and discrimination, all filtered through the prism of self-questioning.",
    "bio": "Rodwittiya studied for her bachelor’s degree in fine arts at from the Faculty of Fine Arts, M. S. University, Baroda, from 1976-81. She simultaneously studied and practised photography under the guidance of eminent Baroda-based artist Jyoti Bhatt. Soon after, she received an Inlaks scholarship to study for her master’s in painting at Royal College of Art, London (1982-84). In the meantime, she also studied film and video at London’s Fulham Institute.\nWorking across mediums, Rodwittiya has created allegorical works that are like psychological dialogues on socio-political issues, concerning topics such as alienation, belonging, acceptance, as also experiences of being a woman in contemporary society. All of this is deciphered through her accumulated observations of the past tempered with her beliefs and values. Her protagonist has often been a woman who is depicted absorbed in her daily routine. Rodwittiya’s colour palette is bright and cheerful and she uses symbols and motifs metaphorically.\nA multi-faceted artist, Rodwittiya exhibits her works regularly in exhibitions in India and abroad, apart from delivering lectures and conducting workshops on Indian art at prestigious international shows. In 1990, she was awarded the fellowship of the Rockefeller Foundation-Asian Cultural Council to work in the U.S. She lives and works in Baroda.",
    "CurrentProductId": "2215",
    "LastArtProId": "2782",
    "profile": "https://dagworld.com/rekharodwittiya.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/e/rekha_rodwittya_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/rodwityar89.jpg",
            "title": "The River of Dreams",
            "year": 1994,
            "medium": "Oil and acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/rodwityar099.jpg",
            "title": "And We Will Clap Whilst the City Burns...",
            "year": 1987,
            "medium": "Acrylic, dry pastel and graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/rodwityar33.jpg",
            "title": "The Ornate Chair Still Beckons",
            "year": null,
            "medium": "Acrylic, watercolour, pastel and graphite on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/rodwityar36.jpg",
            "title": "Which Way Will the River Flow Tomorrow",
            "year": 1987,
            "medium": "Graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/rodwityar47.jpg",
            "title": "Untitled",
            "year": 1998,
            "medium": "Oil and acrylic on canvas"
        }
    ]
}