{
    "name": "Rm. Palaniappan",
    "year": "b - 1957",
    "intro": "Born in Devakottai in Tamil Nadu, Rm. Palaniappan often incorporates the syntax of the sciences, such as diagrammatic notations and symbols, in his work.",
    "bio": "Palaniappan obtained a diploma in fine arts from Government College of Art and Craft, Madras, in 1980, and took a post diploma in industrial design with specialisation in ceramics the following year.\nPrimarily a printmaker, Palaniappan started making drawings and acrylic paintings later on. He is also a photographer and has worked with digital and computer imagery. The memory of the first sight of the earth from above, while on a flight, appears frequently in the form of maps, grids, and aerial terrain. Another important trope in his works has been imagery associated with the flying machine, inspired by his fascination with Second World War cinema.\nPalaniappan was an advisor to Bharat Bhavan, Bhopal, in 1990-92 and 1994-98. In 1992, he visited France on a French government grant, and in 1993 studied advanced lithography at Tamarind Institute, University of New Mexico, and Art Academy of Cincinnati in Ohio, both in the U.S., on a Fulbright grant. In 1996, he was an artist-in-residence at Ruskin School of Drawing and Fine Art, Oxford University, U.K., on a grant from the Charles Wallace Trust. In 1997, he was appointed regional secretary, Lalit Kala Akademi, New Delhi, and curated its exhibition, ‘Major Trends in Indian Art’, marking the fiftieth anniversary of India’s independence. Palaniappan lives and works in Chennai.",
    "CurrentProductId": "2216",
    "LastArtProId": "2795",
    "profile": "https://dagworld.com/rm.palaniappan.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/m/rm_palaniappan_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm06.jpg",
            "title": "Alien Planet-X-9",
            "year": null,
            "medium": "Viscosity, pencil colour and ink on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm103.jpg",
            "title": "Oxford Page X2",
            "year": 1996,
            "medium": "Collage, charcoal, conte and etching on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm17.jpg",
            "title": "Movement Land Architecture-D",
            "year": 1993,
            "medium": "Conte and pastel on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm27.jpg",
            "title": "Untitled",
            "year": 1987,
            "medium": "Etching, viscosity, ink and pencil colour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm29.jpg",
            "title": "Untitled",
            "year": 1988,
            "medium": "Viscosity, ink, graphite and graphics on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/palaniappanrm82.jpg",
            "title": "Untitled",
            "year": 1984,
            "medium": "Viscosity, digital print, ink, marker, graphite and lacquer on paper"
        }
    ]
}