{
    "name": "William Simpson",
    "year": "1823 - 1899",
    "intro": "British draughtsman, lithographer, watercolourist, journalist, and antiquarian, William Simpson was born on 28 October 1823 in Glasgow, Scotland. He is best remembered for his sketches of various wars made for the Illustrated London News.",
    "bio": "Simpson’s early years were difficult as he was born in poverty. In 1834, he was sent to Perth, Australia, to live with his grandmother, which allowed him a chance at formal schooling. Returning to Scotland, he worked as an apprentice in the Glasgow lithographic firm of Macfarlane, and also attended the Andersonian University and the Mechanics Institute in the evenings. He would call this time a ‘turning point’ in his life.\nAs a journalist, Simpson covered the Crimean War (1853-56) and soon joined the Illustrated London News for which he covered the Abyssinian campaign (1868), Franco-Prussian War (1870-71), Modoc War (1873) and the Second Afghan War (1878). He first came to India in 1859, sent by the publisher William Day to work on a large-scale illustrated work showing the country in the wake of the 1857 Mutiny. The project was wrecked with the publisher’s bankruptcy. In 1875-76, Simpson accompanied the Prince of Wales on his tour of India. Throughout his travels in the subcontinent, Simpson kept sketchbooks that contributed to his magnum opus, An Album of Sketches of India, Rajpootana, Himalayas and Tibet.\nA number of Simpson’s watercolours made on foreign travels are in London’s British Museum, along with a small number of archaeological and ethnographic items he collected. Simpson passed away on 17 August 1899 in London.",
    "CurrentProductId": "5470",
    "LastArtProId": "5482",
    "profile": "https://dagworld.com/william-simpson.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/w/i/william_simpson.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/simpsonwilliam005.jpg",
            "title": "Large Deodar Tree. Kunawer, Himalays",
            "year": 1865,
            "medium": "Watercolour and graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/simpsonwilliam006.jpg",
            "title": "The Brindjarries",
            "year": 1863,
            "medium": "Watercolour and graphite on paper"
        }
    ]
}