{
    "name": "William Hodges",
    "year": "1744 - 1797",
    "intro": "The earliest English landscape artist to arrive in India in the eighteenth century, William Hodges is known for his fine landscape drawings and paintings of India made during his four-year stay from 1780-83.",
    "bio": "Born on 28 October 1744 in London, he studied painting under William Shipley, and, later, under Richard Wilson, ‘the father of British landscape’. Initially, he made a living painting backdrops for plays. But he was an established landscape painter by the time he joined explorer James Cook’s second voyage across the Pacific Ocean in 1772-75 as an expedition artist. This voyage resulted in several landscapes of various Pacific islands, among them, famously, Tahiti. \n Hodges was the first of the British artists to arrive in India in search of work, followed by several others, the most notable of whom were the Daniells. In India, Hodges painted several private commissions as well as those for the East India Company, patronised particularly by Governor Warren Hastings. \n Hodges travelled widely in India, in particular along the river Ganga, and sketched places like Agra, Allahabad, Banaras, and Lucknow, providing the first-ever visual depictions of India based on first-hand observation. Upon his return to England, Hodges published a series of forty-eight aquatints under the title Select Views of India, and Travels in India, 1780...1783, ten years after his return—a fascinating account of his travels in the subcontinent, accompanied by sketches. \n Hodges was elected a member of the Royal Academy in 1789. He passed away on 6 March 1797",
    "CurrentProductId": "4725",
    "LastArtProId": "5480",
    "profile": "https://dagworld.com/william-hodges.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/w/i/william_hodges.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dag_4639_copy.jpg",
            "title": "A View of a Hill Village in the District of Baugelepoor",
            "year": 1787,
            "medium": "Soft-ground etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dag_4655_copy.jpg",
            "title": "A View of the Fort of Iionpoor upon the Banks of the River Goomty",
            "year": 1787,
            "medium": "Soft-ground etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dag_4605_copy.jpg",
            "title": "A View of the South side of the Fort of Gwalior",
            "year": 1786,
            "medium": "Soft-ground etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/o/hodgesw0037.jpg",
            "title": "A View of the Fort of Mongheer, upon the Banks of the River Ganges",
            "year": 1787,
            "medium": "Soft-ground etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/o/hodgesw0038.jpg",
            "title": "A View of Shekoabad",
            "year": 1788,
            "medium": "Soft-ground etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/o/hodgesw0039.jpg",
            "title": "A View of a Mosque, at Mounheer",
            "year": 1786,
            "medium": "Soft-ground etching and aquatint on paper"
        }
    ]
}