{
    "name": "S. Dhanapal",
    "year": "1919 - 2000",
    "intro": "In his initial years, S. Dhanapal was drawn towards the Bengal School style and excelled in line drawing and impressionistic watercolours. But his own evolving style tended to incline towards south Indian temple murals, because of which Roy Chowdhury encouraged him to take up sculpture.",
    "bio": "Born on 3 March 1919 in Madras, S. Dhanapal trained under sculptor-teacher D. P. Roy Chowdhury at the city’s Government College of Art and Craft. He joined the faculty of his college after completing his studies, and, in 1957, when K. C. S. Paniker was principal, Dhanapal was appointed the head of the sculpture department. He eventually became principal of his alma mater in 1972.\nDhanapal studied ancient Indian sculptures for their thematic divisions, techniques, iconography, and iconometry, particularly the grammar of Chola, Pallava as well as Mathura sculptures of the Gandhara School.\nMassive and robust, his sculptures retained the fullness of a three-dimensional form. He experimented with various metals, terracotta and wood with a great command over each medium, exploring varied themes ranging from the biblical and mythological to nudes, portraits and narratives.\nBesides being an acclaimed visual artist, Dhanapal also attained fame as a performing artiste—he was an accomplished Bharatanatyam dancer and was part of several dance-drama productions on stage; he learnt the classical dance forms of Kathakali and Kathak too.\nDhanapal won the Lalit Kala Akademi’s national award in 1962; the Akademi’s regional centre in Chennai held his retrospective in 2001, a year after he passed away.",
    "CurrentProductId": "2217",
    "LastArtProId": "2807",
    "profile": "https://dagworld.com/s.dhanapal.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/_/s_dhanpal_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhanapals15.jpg",
            "title": "Mother and Child",
            "year": 1951,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhanapals53.jpg",
            "title": "Village Deity",
            "year": 1987,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhanapals61.jpg",
            "title": "Untitled (Christ with Cross)",
            "year": 1958,
            "medium": "Patinated bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/h/dhanapals65.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Bronze"
        }
    ]
}