{
    "name": "S. G. Thakar Singh",
    "year": "1899 - 1976",
    "intro": "Despite having received no formal training, S. G. Thakar Singh went on to excel in the academic style of painting, rendering stunning landscapes, portraits and still-lifes.",
    "bio": "Born in 1899 in the village of Verka near Amritsar, he showed early aptitude for the arts by drawing on the walls of his home with coal. He apprenticed under local artist Mohd. Alam and moved with him to Bombay when the latter found a job as a stage artist with a theatre company.\nThakar Singh next moved to Calcutta where he worked for theatre companies; in Calcutta, he organised the Punjab Fine Arts Society. He moved back to Amritsar in 1931 and founded Indian Academy of Fine Arts and the Thakar Singh School of Arts.\nA prolific painter, Thakar Singh won the first prize of the Simla Fine Art Society in 1918 when he was not yet twenty. One of his most famous works, After the Bath, which shows a woman’s back with her wet saree clinging to her body in academic-realist style, won the second prize at the British Empire Exhibition in London, 1924.\nDuring the Raj years, Thakar Singh was the state artist for over half-a-dozen princely states. He painted portraits of the royals and travelled widely to paint landscapes and important monuments such as the Taj Mahal and the Elephanta caves. Awarded the Padma Shri in 1973, Thakar Singh passed away on 2 February 1976.",
    "CurrentProductId": "2218",
    "LastArtProId": "2810",
    "profile": "https://dagworld.com/s.g.thakarsingh.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/g/sg_thakar_singh_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhst0017ny.jpg",
            "title": "Fishermen at Dawn on Madras Beach",
            "year": 1928,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhst0018.jpg",
            "title": "Dusk on the Chowpatty Beach Mumbai (Bombay)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thakarsinghsg11.jpg",
            "title": "Untitled",
            "year": 1925,
            "medium": ""
        }
    ]
}