{
    "name": "S. H. Raza",
    "year": "1922 - 2016",
    "intro": "One of India’s most seminal modernists, Syed Haider Raza forged a new language of art by integrating Indian symbolism with Western expression.",
    "bio": "Born on 22 February 1922 in Mandla, Madhya Pradesh, he was a student of Sir J. J. School of Art, Bombay (1943-47), and one of the first members of the Progressive Artists’ Group, the turning point of his career was his journey to Paris in 1950 on a French government scholarship to study at École Nationale des Beaux-Arts. In 1956, he became the first non-French artist to win the critic’s award, the Prix de la critique.\nRaza almost exclusively excluded the human figure from his vocabulary, choosing landscapes instead. In the 1960s, he drifted away from realistic landscapes towards ‘gestural expressionism’, a form of abstraction. Ultimately, Raza’s paintings evolved from his childhood memories of dense forests and the river Narmada, the bright colours of the Indian market, as if drawn towards the black dot—the bindu—drawn by his schoolteacher as an attempt to help him focus and meditate. The imagery transmuted into geometrical lines and intense bursts of colour on canvas in a geometrical exploration of tantra.\nAmong prominent honours, Raza received the Kalidas Samman, Lalit Kala Akademi’s Lalit Kala Ratna, and the Indian government’s Padma Shri, and Padma Bhushan. His works are among the most high valued works at auctions of Indian art.\nAfter living in France for six decades, Raza shifted to New Delhi in 2010, where he passed away on 23 July 2016.",
    "CurrentProductId": "2220",
    "LastArtProId": "5819",
    "profile": "https://dagworld.com/s.h.raza.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/sh_raza_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/razash085.jpg",
            "title": "Untitled",
            "year": 1978,
            "medium": "Acrylic on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/razash185.jpg",
            "title": "La Berge (The Riverbank)",
            "year": 1969,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/razash189.jpg",
            "title": "Naga",
            "year": 2002,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/razash_04c.jpg",
            "title": "Nari",
            "year": 1998,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/razash0198.jpg",
            "title": "Untitled (Bois des Amants)",
            "year": 1964,
            "medium": "Oil on canvas"
        }
    ]
}