{
    "name": "S. K. Bakre",
    "year": "1920 - 2007",
    "intro": "Sadanandji K. Bakre's preoccupation with abstraction in his sculptures was inspired by Paul Klee’s lyricism and Picasso’s de-structuring of form.",
    "bio": "A founding member of the Progressive Artists’ Group, he was born in Baroda, Gujarat, on 10 November 1920. Bakre obtained a diploma in modelling and stone carving from Sir J. J. School of Art, Bombay, following which he was a pilot with the Air Force during the Second World War.\nIn 1947, along with his friend F. N. Souza, Bakre founded the Progressive Artists’ Group, which was joined by S. H. Raza, K. H. Ara, H. A. Gade, and M. F. Husain, as founder members.\nRudi von Leyden, a leading voice of the Indian art scene in the mid-twentieth century, introduced Bakre to the modernist movements of the U.S. and Europe, and helped mentor his ideology. Dissatisfied with the contemporary art scene in India at the time, Bakre left for London to pursue his career and earned international renown, both as a sculptor and painter.\nBakre potentialised the human form by transforming it through distortion, fragmentation, and partial elimination. His canvases were executed in a sculptural manner depicting geometrical grids and abstracted human forms in a two-dimensional pattern. The bold and bright colours highlighted the contrast of straight and curved lines.\nA much-feted artist, Bakre returned to India in the later years to lead a recluse’s life. He passed away in Ratnagiri, Maharashtra, on 18 December 2007.",
    "CurrentProductId": "2221",
    "LastArtProId": "5809",
    "profile": "https://dagworld.com/s.k.bakre.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/k/sk_bakre_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bakres037.jpg",
            "title": "Two Prophets in One",
            "year": 1998,
            "medium": "Oil on plywood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bakres048.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "White metal"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bakres06.jpg",
            "title": "Untitled",
            "year": 1964,
            "medium": "Oil on canvas pasted on cloth"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bakres159.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on jute pasted on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/bakres030.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}