{
    "name": "S. L. Haldankar",
    "year": "1882 - 1968",
    "intro": "It was for S. L. Haldankar's delicate handling of transparent watercolour landscapes that the Bombay critics coined the term ‘Open Air School’ in their art reviews.",
    "bio": "Born in Sawantwadi, a princely state in the Bombay Presidency of the British Raj, or present-day Maharashtra, his talent for the arts was spotted by his school headmaster and Haldankar received a scholarship to study at Sir J. J. School of Art, from where he took a diploma in painting in 1903.\nAfter his graduation, Haldankar opened an art institute in Bombay in 1908, called Haldankar’s Fine Art Institute. He was active in the art circles of Bombay and was a keen member of important art committees and societies—in 1918, he cofounded Art Society of India along with other artists and remained its president for several years. He was also associated with Maharashtra Chitrakar Mandal and Hansa Mehta Committee for Reorganisation of Art Education.\nAccomplished in both oil and watercolour painting, Haldankar had a special aptitude for portraits. Besides portraits of common people, he was also commissioned to paint those of several eminent personalities, among them Pt. Madan Mohan Malviya, Jagannath Sunkersett, Sir John Beaumont, Lady and Sir Leslie Wilson, and the Raja Saheb of Sawantwadi.\nAlong with M. K. Parandekar, M. V. Dhurandhar, and M. R. Acharekar, he became one of the earliest Indian artists to paint outdoor vistas and archaeological monuments on location, a trend that gripped the Bombay region in the early decades of the twentieth century.",
    "CurrentProductId": "2222",
    "LastArtProId": "2824",
    "profile": "https://dagworld.com/s.l.haldankar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/l/sl_haldankar_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haldankarsl02.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haldankarsl14.jpg",
            "title": "Nasik-Nav Panchwati",
            "year": 1945,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haldankarsl25.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haldankarsl58.jpg",
            "title": "Untitled",
            "year": 1926,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/haldankarsl59.jpg",
            "title": "Sadhu",
            "year": 1925,
            "medium": "Watercolour on handmade paper"
        }
    ]
}