{
    "name": "Sadequain",
    "year": "1930 - 1987",
    "intro": "One of the most important South Asian artists of the twentieth century, Syed Ahmed Sadequain Naqvi was born in Amroha in Uttar Pradesh in pre-Partition India and grew up in a family that highly valued calligraphy.",
    "bio": "He moved to Delhi in 1944 to work as a calligrapher-copyist with All India Radio where his elder brother was also working, but shifted to Pakistan following Partition. Moving between jobs for a few years in his new homeland, Sadequain devoted himself fully to the arts in 1955 after his fame as an artist rose with the patronage of the country’s prime minister, Huseyn Shaheed Suhrawardy.\nIt was around this time that two important characteristics of Sadequain’s art started taking concrete shape—the influence of Pablo Picasso in his figurative works, and the trope of the cactii, used as a metaphor for human struggle. The thorny plant even became part of his calligraphic work, which was the source of all his art.\nAt the 1961 Paris Biennale, Sadequain was declared an artist laureate in the ‘Under 35’ category and awarded a scholarship, which allowed him to travel across Europe and the U.S. and hold solo exhibitions in London and Paris. Post his return to Pakistan in 1967, Sadequain started focusing mostly on calligraphy. He was also commissioned by the state to make murals for important buildings such as the ceiling of Frere Hall in Karachi, and the State Bank of Pakistan building. Sadequain passed away in Karachi on 10 February 1987.",
    "CurrentProductId": "2224",
    "LastArtProId": "5833",
    "profile": "https://dagworld.com/sadequain.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sadequain.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sadequain01.jpg",
            "title": "Untitled (Bol Ke Lab Azaad Hain Tere)",
            "year": 1976,
            "medium": "Oil, marker and charcoal on Rexene"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sadequain12.jpg",
            "title": "Couple Embracing",
            "year": 1976,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sadequain13.jpg",
            "title": "Untitled",
            "year": 1982,
            "medium": "Oil and marker on canvas"
        }
    ]
}