{
    "name": "Sanat Chatterjee",
    "year": "1935 - 2017",
    "intro": "Sanat Kumar Chatterjee's choice of subjects included the pantheon of Hindu deities, landscapes and other figurative slice-of-life images.",
    "bio": "One of the last proponents of the Bengal School, Sanat Kumar Chatterjee was born in 1935 in Lucknow, and grew up in various cities of British India as his father had a transferable job with Indian Railways. Encouraged by his parents, he obtained a diploma in fine arts from the Government College of Arts and Crafts, Lucknow, in 1960.\nAs a teenager, Chatterjee had met Asit Kumar Haldar, a major pioneer of the Bengal School. For fourteen years, Chatterjee trained under Haldar, the principal of his art school. He also studied under Kshitindranath Majumdar in Allahabad.\nHowever, Chatterjee gradually evolved his own style and became especially renowned for his watercolour on silk paintings in the wash technique, some of which were gigantic scrolls. One of these, measuring 100 ft x 11 ft, entered the Guinness Book of World Records in 1998 as the world’s longest painting. It details the concept of Mahashakti, the feminine principle of the Hindu concept of creation, preservation, and destruction, interspersed with zodiac signs from Hindu astrology. Besides being a painter, sculptor, poet, and musician, Chatterjee dabbled in astrology too.\nOn Haldar’s advice, Chatterjee shifted to Simla early in his career, serving as the head of the fine arts department at its Government College for several years. He passed away on 11 April 2017 in Simla.",
    "CurrentProductId": "2227",
    "LastArtProId": "2844",
    "profile": "https://dagworld.com/sanatchatterjee.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sanat_chatterjee_1_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chatterjees14.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour wash on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chatterjees17.jpg",
            "title": "Untitled (Shiva-Parvati)",
            "year": null,
            "medium": "Watercolour wash on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chatterjees20.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chatterjees21.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on paper"
        }
    ]
}