{
    "name": "Sankho Chaudhuri",
    "year": "1916 - 2006",
    "intro": "One of India’s foremost sculptors, Sankho Chaudhuri’s work is an important key in the evolution of modern, abstract sculpture in the country, breaking away from traditional figuration and mid-Victorian academic naturalism.",
    "bio": "Born on 15 February 1916 in Santhal Pargana in present-day Jharkhand, Chaudhuri obtained his bachelor’s in art and a diploma in sculpture, both from Santiniketan, in 1939 and 1945 respectively. He was a student of renowned sculptor Ramkinkar Baij, known for using unconventional materials such as cement for making sculptures. Accompanying Baij on a trip to Nepal to execute a war memorial, Chaudhuri learnt Nepali metal casting. In 1949, he went on a study tour of Europe, visiting art centres in England, France, Italy, Switzerland, Belgium, and the Netherlands.\nChaudhuri is best known for his simple, flowing sculptures. He has constantly experimented with material: using clay, terracotta, plaster, and cement, stone, wood, copper, brass, and aluminium. His sculptures often consist of entwined forms that create a harmonious rhythm in their balanced stances. Clear lines accentuate the form in his work.\nHe received the Lalit Kala Akademi’s national award in 1956 and the Lalit Kala Ratna honour in 2004. He was honoured with the Padma Shri in 1971. Some of his well-known works are Music for All India Radio in 1957, bronze statues of Mahatma Gandhi exhibited in Rio de Janeiro in 1964 and Copenhagen in 1986, among others. He passed away in New Delhi on 28 August 2006.",
    "CurrentProductId": "2229",
    "LastArtProId": "2849",
    "profile": "https://dagworld.com/sankhochaudhuri.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sankho_chaudhary_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhurys04.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Wood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhurys15.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Bronze on wooden base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhurys20.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Brass on wooden base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhurys23.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Bronze on wooden base"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chowdhurys24ny_.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Bronze on wooden base"
        }
    ]
}