{
    "name": "Sarada Charan Ukil",
    "year": "1888 - 1940",
    "intro": "An artist whose eponymously named art institution groomed some important Indian modern artists such as Ram Kumar and J. Swaminathan, Sarada Charan Ukil was an early pioneer of the Bengal School.",
    "bio": "Born on 14 November 1888 in Bikrampur near present-day Dhaka, Ukil shifted later to Calcutta with his family and studied at the city’s Government Art School under Abanindranath Tagore.\nHe shifted to New Delhi in 1918 and joined Lala Raghubir Singh’s school, today known as Modern School, as art teacher. He simultaneously started Sarada Ukil School of Art on Janpath, New Delhi, which continues to function as a training school for art teachers. His granddaughter, Rita Dey, shares family’s stories of several rulers of principalities visiting the school for their portraits to be made by Ukil.\nAlso an actor, Ukil was cast as Gautam Buddha’s father, King Shuddhodhana, in German director Franz Osten’s 1925 silent film, Light of Asia. Ukil would go on to paint an entire series on the life of the Buddha, generally considered his masterpiece. However, only one original painting from the series, Buddha in Death Bed, survives, housed in the Salarjung Museum, Hyderabad; the rest survive only as photographs or post cards. His paintings were drawn from religious and mythological stories, executed in the soft hues of the wash technique.\nAlong with his brothers Barada and Ranada, Ukil founded the All India Fine Arts and Crafts Society in New Delhi in 1928. Ukil passed away at the age of fifty-two on 21 July 1940 in New Delhi.",
    "CurrentProductId": "2363",
    "LastArtProId": "5793",
    "profile": "https://dagworld.com/sarada-charan-ukil.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sarada_ukil.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/u/k/ukils05.jpg",
            "title": "Untitled",
            "year": 1938,
            "medium": "Watercolour wash on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/u/k/ukils06ny.jpg",
            "title": "Untitled (Cycle of Life)",
            "year": 1923,
            "medium": "Watercolour, graphite and gold pigment on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/u/k/ukilrc0008ny.jpg",
            "title": "Untitled",
            "year": 1923,
            "medium": "Graphite on paper"
        }
    ]
}