{
    "name": "Shuvaprasanna",
    "year": "b - 1947",
    "intro": "Beset by problems and politics, but possessing great potential, Kolkata has remained Shuvaprasanna's abiding inspiration as he absorbs and responds to its upheavals, the tumult of its masses, and its frequent political turbulence.",
    "bio": "Born in Calcutta on 20 October 1947, he is a quintessential painter of the eastern metropolis that he unabashedly loves. He graduated from Indian College of Art, Rabindra Bharati University, Calcutta, in 1969. An active member of Calcutta Painters group, urban themes are a constant in his work.\nSkilled in painting, etching, and drawing in mixed media, his artistic and personal concerns lie with urban decay and an anxiety of the collapse of urban culture, seen in his well-known works featuring crows and owls, and the series Illusion, Clock and Bird. This is also visible in his cityscapes which are curiously devoid of human presence; empty lanes and bylanes speak of the absence of the multitudes that populate this crowded city.\nIn 1984, he founded Arts Acre, an artists’ village in Calcutta, and has worked as editor of Art Today magazine. Awarded by institutions like Birla Academy of Art and Culture, Kolkata, Lalit Kala Akademi, West Bengal, and All India Fine Arts and Crafts Society, New Delhi, he was the subject of a documentary film by Goutam Ghose, titled Shuva and Me, in which the two visited Germany to meet German Nobel-laureate Günter Grass. Shuvaprasanna continues to live and work in Kolkata with his artist wife Shipra Bhattacharya.",
    "CurrentProductId": "2235",
    "LastArtProId": "2874",
    "profile": "https://dagworld.com/shuvaprasanna.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna093.jpg",
            "title": "Bird III",
            "year": 1994,
            "medium": "Oil on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna02.jpg",
            "title": "Untitled",
            "year": 1973,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna070.jpg",
            "title": "Lament",
            "year": 1971,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna083.jpg",
            "title": "Beast",
            "year": 1997,
            "medium": "Acrylic and charcoal with rice paper on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna088.jpg",
            "title": "Untitled",
            "year": 1988,
            "medium": "Oil and acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/suvaprasanna102.jpg",
            "title": "The Owl",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}