{
    "name": "Shyamal Dutta Ray",
    "year": "1934 - 2005",
    "intro": "Laden with satire and wit, and often subtly political, Shyamal Dutta Ray's work communicated his preoccupation with the human condition.",
    "bio": "Among the most accomplished watercolourists of modern India, he was born in Ranchi, then in Bihar, and studied at Government College of Arts and Crafts, Calcutta, from 1950-55. He was a founding member of Society of Contemporary Artists in 1959, and of Painters 80, founded in 1968.\nDutta Ray suffered from severe ill-health while growing up and witnessed the horrors of the 1943 Bengal famine as a child, both of which impacted his life and art tremendously. He began his career working in oil but had to switch to watercolour on medical advice as he was allergic to oil paints. Dutta Ray became a master of the demanding medium of watercolour and brought about a major development in its application by using saturated hues instead of the diluted colours prevalent among his contemporaries. He painted the contradictory contemporary reality of Calcutta, filled with sorrow, poverty, despair, as also happiness, and hope.\nThe masterful depiction of pathos in watercolours won him several awards within India and abroad including the gold medal of Academy of Fine Arts, Calcutta, in 1958, the Rabindra Bharati University award in 1968, several annual awards of the Birla Academy of Art and Culture, Calcutta, Lalit Kala Akademi’s national award in 1982, and the Karnataka Chitrakala Parishath award and the Shiromani Puraskar, both in 1988. He passed away in 2005.",
    "CurrentProductId": "2236",
    "LastArtProId": "2880",
    "profile": "https://dagworld.com/shyamalduttaray.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/shyamal_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd07.jpg",
            "title": "Untitled",
            "year": 2000,
            "medium": "Charcoal and ink on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd100.jpg",
            "title": "Untitled",
            "year": 1980,
            "medium": "Aquatint and etching on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd103.jpg",
            "title": "La Scène",
            "year": 1972,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd58.jpg",
            "title": "Untitled",
            "year": 1997,
            "medium": "Watercolour and ink on paper, pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd80.jpg",
            "title": "Untitled",
            "year": 1982,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/raysd82.jpg",
            "title": "Trap",
            "year": 1968,
            "medium": "Oil on canvas"
        }
    ]
}