{
    "name": "Sobha Singh",
    "year": "1901 - 1986",
    "intro": "The most definitive painter of the portraits of the Sikh gurus, Sobha Singh was born on 29 November 1901 at Gurdaspur in the Punjab.",
    "bio": "Interested in the arts since childhood, he learnt to draw and sculpt on his own, the early death of his parents depriving him of formal training in art. He joined the British Indian army as a draughtsman and continued to learn from studying the works of English and European artists.\nOn quitting the army in 1923, he settled in Amritsar where he also opened his studio. Moving between Amritsar, Lahore, and Delhi, over the next two decades, he continued to paint and participate in exhibitions, earning a reputation as a portrait painter. In 1946, he found employment as an art director in Lahore for a film, but Partition forced him to move again. He finally settled down in the artists’ village of Andretta in Himachal Pradesh.\nPainting images of the Sikh gurus remained his prime focus as an artist, but he also made other portraits of freedom fighters, heroes of the Indian army, as also characters from popular folk stories of Punjab such as Heer-Ranjha. He also executed landscapes and sculptures.\nSingh was honoured with the Padma Shri by the Government of India that also commissioned a documentary on his life, Painter of People, to mark his seventy-fifth birthday. He passed away on 22 August 1986 in Chandigarh. His family continues to run the Sobha Singh Art Gallery and Museum in Andretta.",
    "CurrentProductId": "2237",
    "LastArtProId": "2882",
    "profile": "https://dagworld.com/sobhasingh.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/sobha_singh__1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhsobha001.jpg",
            "title": "Untitled",
            "year": null,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhsobha002.jpg",
            "title": "Shiva’s Devotee",
            "year": null,
            "medium": "Gouache on fabric pasted on mount board"
        }
    ]
}