{
    "name": "Sudhir Ranjan Khastgir",
    "year": "1907 - 1974",
    "intro": "Sudhir Ranjan Khastgir was one of those modernists from Bengal who, despite being trained in Santiniketan, did not bear affinity to its artistic credos, nor to any other prevalent style.",
    "bio": "Born on 24 September 1907 in Chittagong in present-day Bangladesh, he studied at Kala Bhavana, Santiniketan, under Nandalal Bose. Like his classmate, Ramkinkar Baij, he took up sculpture as a subject, continuing its pursuit in Lucknow under Hiranmoy Roychaudhuri in 1932, and under Ganpath Kashinath Mahatre, in Bombay, in 1933. The same year, he joined Scindia School, Gwalior, as a teacher and, later, Doon School in Dehradun.\nWhile still a teacher, Khastgir went to Deutsch Academy, Munich, in 1937, for his postgraduation. In 1947, his solo exhibition in London at Imperial Institute was opened by eminent sculptor Eric Gill. In 1956, he became principal of Government College of Arts and Crafts, Lucknow, from where he retired in 1962.\nLike Baij, Debi Prasad Roy Chowdhury, and Chintamoni Kar, Khastgir too was a painter-sculptor and did portraits of several eminent personalities, including Rabindranath Tagore and Jawaharlal Nehru. His sculptural compositions included themes from the real and the mythical world. In his paintings, he idealised the toilers of land and captured the beauty of landscapes, but also drew from a historical past.\nIn 1957, he was awarded the Padma Shri by the Government of India. Khastgir passed away on 6 June 1974, in Calcutta.",
    "CurrentProductId": "2241",
    "LastArtProId": "2894",
    "profile": "https://dagworld.com/sudhirkhastgir.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/sudhir_khastagir.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs003.jpg",
            "title": "Untitled",
            "year": 1957,
            "medium": "Watercolour, ink and pastel on rice paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs067.jpg",
            "title": "Untitled",
            "year": 1960,
            "medium": "Ink on rice paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs101.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour and pastel on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs148.jpg",
            "title": "Untitled",
            "year": 1964,
            "medium": "Oil and oil pastel on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs154.jpg",
            "title": "Untitled",
            "year": 1964,
            "medium": "Oil and ink on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khastgirs168.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on Masonite board"
        }
    ]
}