{
    "name": "Sunil Madhav Sen",
    "year": "1910 - 1979",
    "intro": "Sen drew inspiration from popular Indian arts, Rabindranath Tagore’s treatment of colour, Mexican lithographer José Posada’s application of terror as an element of art, and Gaganendranath Tagore’s use of cubist elements.",
    "bio": "Born in Purulia in West Bengal, Sunil Madhav Sen was a self-taught artist. Though he learned drawing as a child from a local teacher, he studied law and the liberal arts at Calcutta University and worked for the government. He pursued his passion for art privately alongside his legal practise, visiting the studios of Abanindranath Tagore, Atul Bose, J. P. Gangooly, and Satish Sinha. He also apprenticed for two years under Hemendranath Mazumdar, honing his skills in portrait painting.\nIn his initial years as an artist, Sen made charcoal studies of figures and animals, painted portraits, and made copies of the works of old European masters such as Italian Baroque artist Guido Reni, Dutch master Rembrandt, and sixteenth century Greek artist El Greco. Holding his first solo show in 1950, Sen joined the seminal Calcutta Group in 1952, which was founded in 1943 as a rejection of the Bengal School, and believed in painting the social and political reality of the times.\nHis subjects were Nepalese women, Bhutia boys, ordinary life, the dispossessed, the Quit India movement, the Bengal famine, gods and goddesses, and the terror and beauty of children’s dreams. His works are part of collections at National Gallery of Modern Art, New Delhi, Library of Congress, U.S.A., New York Public Library, and Bradford Museum.",
    "CurrentProductId": "2245",
    "LastArtProId": "2918",
    "profile": "https://dagworld.com/sunilmadhavsen.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/sunil_madhav_sen.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm023.jpg",
            "title": "Musician",
            "year": null,
            "medium": "Oil, gravel and white cement on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm058.jpg",
            "title": "Self Portrait with a Pipe",
            "year": null,
            "medium": "Oil and enamel on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm075.jpg",
            "title": "Still Life",
            "year": null,
            "medium": "Gouache on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm184.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil and stone granules on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm192.jpg",
            "title": "Christ",
            "year": null,
            "medium": "Oil on oil paper pasted on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm198.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Gouache on paper pasted on mountboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sensm200.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour and ink on paper"
        }
    ]
}