{
    "name": "Sushil Chandra Sen",
    "year": "1909 - 1972",
    "intro": "Sushil Chandra Sen is remembered for his academic-realist landscapes made primarily in watercolour but also in oil. He also made numerous woodcuts and etchings on Bengal village life, capturing the languid beauty of its environs and inhabitants.",
    "bio": "Enamoured by watercolour as a medium, Sen studied at Government School of Art, Calcutta; in 1936, he joined the school as a lecturer. He also taught briefly at Delhi Polytechnic before returning to Calcutta to officiate as vice-principal of his alma mater.\nInspired by Mukul Dey, Sen responded to the country’s socio-political situation and the new realism of contemporary literature, which led to his works undergoing a dramatic change from the romantic idealisation of themes on the life of the common man. He painted pastoral and urban landscapes, intimate household scenes, social and religious functions, street scenes, and riversides, to much acclaim. Of special mention is Sen’s large mural painted at Parliament House, New Delhi, depicting King Mahameghavahana Kharavela of Kalinga and his Jain council held at Udaygiri in the second century B.C.\nSen was associated with several art institutions in the country, among them Lalit Kala Akademi, New Delhi, Visva-Bharati, Santiniketan, and Calcutta University, as well as various government art galleries.\nHe also exhibited widely in the country and abroad, including Kabul, Afghanistan, and various cities in the U.S. Sen’s work forms part of collections such as those of Academy of Fine Arts and Rabindra Bhavan, both in Kolkata.",
    "CurrentProductId": "2247",
    "LastArtProId": "2935",
    "profile": "https://dagworld.com/sushilchandrasen.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/u/sushil_chandra_sen_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sens04.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sens13.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sens42.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Lithograph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sens49.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/sens51.jpg",
            "title": "Sindhu / At the Hermitage",
            "year": 1944,
            "medium": "Watercolour wash on paper"
        }
    ]
}