{
    "name": "K. K. Hebbar",
    "year": "1911 - 1996",
    "intro": "Kattingeri Krishna Hebbar, born on 15 June 1911 near Udupi in Karnataka, showed an inclination for the arts from his childhood—his father used to make Ganesha idols.",
    "bio": "For Hebbar, Indian classical art remained a ceaseless source of inspiration, even though he was drawn to impressionism while studying at Sir J. J. School of Art, Bombay, from 1934-38. His early paintings—landscapes and figural compositions in the academic style—disciplined his hand and mind and led him towards his own style.\nInspired by the Sri Lankan philosopher Ananda Coomaraswamy’s discourses, Hebbar began exploring his creativity through the traditional Indian art found in Jain manuscripts, Rajput and Mughal miniatures, and the Ajanta frescos, harmoniously blending it with surrealism and abstraction in his work. Strongly inspired by Amrita Sher-Gil’s expression of the East through western techniques, Hebbar left for Europe in 1949 to explore western art further.\nThis exploration brought him to the Académie Julian in Paris where he studied under the impressionist painter Professor Cavailles, and later graphics at École Estienne. From 1964-75, he travelled across Europe, exhibiting his work. Upon his return, Hebbar experimented with mediums, methods and styles in order to find his own metre, even learning the classical dance form of Kathak to understand rhythm. Instinctively, he portrayed places and people as he saw them—a developing India in which he witnessed both celebration as well as suffering.\nIn 1976, Hebbar was selected a fellow of the Lalit Kala Akademi. From 1953-73, he served as the chairman of the Artist’s Centre, Bombay, and received the Padma Bhushan from the Government of India in 1989. He passed away on 26 March 1996.",
    "CurrentProductId": "2144",
    "LastArtProId": "5862",
    "profile": "https://dagworld.com/k.k.hebbar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/k/kk_hebbar_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk02.jpg",
            "title": "Untitled (Art Critic S. A. Krishna)",
            "year": 1982,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk27.jpg",
            "title": "Untitled",
            "year": 1948,
            "medium": "Ink on scraperboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk44_1.jpg",
            "title": "Fishing",
            "year": 1991,
            "medium": "Oil on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk74.jpg",
            "title": "Hungry Soul",
            "year": 1952,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk0078.jpg",
            "title": "A Village near Mahableshwar in the Monsoon",
            "year": 1952,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/e/hebbarkk72.jpg",
            "title": "Untitled (Folk Dance)",
            "year": null,
            "medium": "Gouache and watercolour on paper pasted on mount board"
        }
    ]
}