{
    "name": "K. S. Radhakrishnan",
    "year": "b - 1956",
    "intro": "Musui and Maiya—the thinly-fluted male and female bronze figures, often swaying or leaping in joy—are perhaps as well-known as their creator, K. S. Radhakrishnan.",
    "bio": "One of the most significant contemporary sculptors, Radhakrishnan often refers to the bronze characters as his alter egos.\nBorn on 7 February 1956, in Kottayam, Kerala, Radhakrishnan found early inspiration in the works of his uncle, P. N. Narayanan Kutty. He joined the Kala Bhavana at Visva-Bharati University, Santiniketan, in 1974, earning his bachelor’s in 1979; he was awarded a national scholarship by the Government of India in 1978, while still a student. He also completed his masters from Santiniketan, in 1981.\nMentored by two prominent figures of modern Indian art—Ramkinkar Baij and Sarbari Roy Choudhary— Radhakrishnan has experimented with a wide variety of materials such as molten bronze, beeswax, and plaster of paris, where the tactile, physical process of working with the material is as essential as the final work. Through his iconic bronze figures, he connects to the ordinary man’s innermost quest for expressing himself or herself through the contours and figuration of the body.\nRadhakrishnan’s accolades include an award for the best sculpture award in 1980 from Birla Academy of Art and Culture, Calcutta, and a research grant the following year from the Lalit Kala Akademi to work at Garhi Studios, New Delhi. \r\nSeveral of his sculptures are installed around the world— Cotignac (France), London, Denmark, and Chicago, and large works have been commissioned in Dehradun, Bikaner, New Delhi, Goa, Santiniketan, and, of course, in his native Kerala. He lives and works in New Delhi.",
    "CurrentProductId": "2147",
    "LastArtProId": "3138",
    "profile": "https://dagworld.com/k.s.radhakrishnan.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/s/ks_radhakrishnan_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/radhakrishananks01.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Bronze and copper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/radhakrishananks02.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Patinated bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/radhakrishananks06.jpg",
            "title": "Untitled",
            "year": 1990,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/a/radhakrishananks07.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Patinated bronze"
        }
    ]
}