{
    "name": "Kartick Chandra Pyne",
    "year": "1931 - 2017",
    "intro": "Born into an aristocratic family of gold merchants, Kartick Chandra Pyne took an interest in art at an early age.",
    "bio": "The older cousin of Ganesh Pyne, another remarkable Indian modernist, K. C. Pyne graduated in fine arts from the Government College of Arts and Crafts, Calcutta, in 1955. Later, he taught at Calcutta’s Indian College of Arts and Draughtsmanship in the 1970s, and the Academy of Fine Arts in the ’80s.\nOne of India’s foremost surrealist painters who was influenced by artists such as Rabindranath Tagore, Marc Chagall, and Joan Miró, Pyne famously said, ‘I did not really know that I worked in the surrealist style till it was pointed out to me.’ His works, spontaneous and individualistic, had surreal imagery in bold colours. A four-time winner of the award of the Academy of Fine Arts, Calcutta, Pyne had represented India in the exhibition titled ‘100 Years of Modern Indian Art’ held at the Fukuoka Museum, Japan, in 1979.\nAn intensely private person, he preferred to pause, reflect and focus on painting while exploring a range of subjects—myth, fables, human stories, culture, memories, fantasy, erotica—in a vibrant palette. Art, for Pyne, was an intimate approach, thus requiring the artist to still the mind and experience the meditative aspect of creation.\nNothing stopped him, not even a paralytic stroke that affected the left side of his body in 1994. In fact, in the late ’90s, Pyne painted his acclaimed nude series. He was painting till a year before his death, for as long as he could hold a brush, at his home in Kolkata.",
    "CurrentProductId": "2140",
    "LastArtProId": "3128",
    "profile": "https://dagworld.com/k.c.pyne.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kartick_chandra_pyne.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/y/pynek02.jpg",
            "title": "Untitled",
            "year": 1997,
            "medium": "Watercolour, charcoal and ink on rice paper pasted on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/y/pynek0004.jpg",
            "title": "Untitled",
            "year": 1998,
            "medium": "Acrylic and pastel on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/y/pynek39.jpg",
            "title": "Untitled",
            "year": 2000,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/y/pynek40.jpg",
            "title": "Untitled (Portrait)",
            "year": null,
            "medium": "Oil on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/y/pynek74.jpg",
            "title": "A Painting in Red",
            "year": 1995,
            "medium": "Acrylic and oil on canvas"
        }
    ]
}