{
    "name": "Khagen Roy",
    "year": "1907 - 1983",
    "intro": "Khagen Roy hailed from Medinipur in present-day West Bengal and came to Calcutta to study art.",
    "bio": "However, he left the Government School of Art in Calcutta as well as the College of Arts and Crafts in Lucknow dissatisfied with their curriculum. A chance encounter with painter and sculptor D. P. Roy Chowdhury convinced him to join the Government College of Art and Craft, Madras.\nRoy’s works are distinct for his times as they followed neither the period’s nationalist art, nor the academic realism taught at colonial art schools. He developed an eclectic personal style, experimenting with several mediums, and executed some large scale works, including murals. Upon returning to Medinipur after his studies, he was commissioned by the district magistrate to create murals for the local Vidyasagar Memorial.\nKnown for his depictions of popular mythological characters and episodes in a bright palette, Roy imparted a touch of delicate beauty and lyricism to his works. He primarily worked in watercolours.\nHis works began to appear in journals, and he opened an interior design firm, Roy Studio, on Dharamatala Street in Calcutta. Part of the active cultural scene of Calcutta, he was a member of Art Rebel Centre—that he joined in 1933—and various other short-lived artistic groups and societies that thrived in the eastern metropolis in the early years of the twentieth century before the Academy of Fine Arts was established in Calcutta. Roy also set up the Medinipur Academy of Fine Arts and Crafts.",
    "CurrentProductId": "2150",
    "LastArtProId": "5054",
    "profile": "https://dagworld.com/khagenroy.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khagen_roy.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royk04.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Gouache on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royk09.jpg",
            "title": "Shiva and Parvati",
            "year": null,
            "medium": "Tempera on ply board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royk08_4.jpg",
            "title": "Untitled (Diptych)",
            "year": null,
            "medium": "Tempera and gold leaf on Masonite board"
        }
    ]
}