{
    "name": "Kisory Roy",
    "year": "1911 - 1965",
    "intro": "Well-known for his landscape paintings, Kisory Roy was inspired to take up the arts by his father, who worked for the railways and was an occasional painter.",
    "bio": "Winning a school competition led Roy to the Government School of Art, Calcutta, where he studied from 1931-37. Under Mukul Dey, he learnt to work in several mediums like watercolour, oil, charcoal, and crayon.\nIn 1939, he learnt landscape painting under J. P. Gangooly and was considered one of his last great students. Though he made works in other genres as well, it was his landscapes that lent him an enduring reputation. Roy’s sublime renditions of natural vistas in oil, such as Darjeeling by Night, Light Awakening, Pleasure Boat, Blue Mountain, Kumaun Himalaya, among other works, stand out for the treatment of light and are a great balance between Bengal School and academic mannerisms. He travelled widely to paint en plein air. One of his most well-known paintings is that of the Howrah Bridge by night.\nRoy also painted murals for the Ramgarh Palace, in present-day Jharkhand. His portraits of contemporary luminaries such as Sir N. N. Sarkar, L. M. Sen, his teacher J. P. Gangooly, novelist Sarat Chandra Chatterjee, and others are well known. He exhibited widely in Calcutta, Delhi and Bombay.\nRoy taught at the Uttarpara Government High School in Calcutta and later joined his alma mater in 1950, where he taught for the next fifteen years, till his death at the age of fifty-four years.",
    "CurrentProductId": "2356",
    "LastArtProId": "3160",
    "profile": "https://dagworld.com/kisory-roy.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/i/kisory_roy.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/roykisory11.jpg",
            "title": "Mr. J. P. Gangooly Resting in his Studio",
            "year": 1948,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/roykisory32_1.jpg",
            "title": "Kumaun Landscape",
            "year": 1950,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/roykisory38ny.jpg",
            "title": "Untitled (Darjeeling by Night)",
            "year": 1947,
            "medium": "Oil on canvas"
        }
    ]
}