{
    "name": "Krishen Khanna",
    "year": "b - 1925",
    "intro": "Born in Lyallpur in pre-Partition Punjab, Krishen Khanna grew up in Lahore, and studied at the Imperial Service College, England, from 1938-42 as a Rudyard Kipling scholar.",
    "bio": "Returning to Lahore for a course in English literature at the Government College, he simultaneously took evening classes at the Mayo School of Art. Khanna briefly worked as a printer at Kapur Art Press, Lahore, before his family moved to Simla upon Partition. He worked at the Grindlays Bank in Bombay and Madras from 1946-61, subsequently resigning from his job to devote himself to art.\nIn Bombay, he became part of the extended Progressive Artists’ Group. Largely self-taught, Khanna’s art bears imprints of the traumatic experience of the socio-political chaos in the country in his youth. He first exhibited his works in 1949, when his first painting was bought by nuclear physicist Dr. Homi Bhabha, the founder director of Tata Institute of Fundamental Research. In 1955, Khanna held his first solo show at U.S.I.S., Madras. His support for the marginalised and downtrodden shines through in his paintings depicting bandwallahs, dhabas, pavement fruit-sellers, and migrant labourers in trucks.\nIn 1962, Khanna became the first Indian artist to be awarded the Council on Economic and Cultural Affairs (later renamed the John D. Rockefeller III Fund) fellowship, and was artist-in-residence at the American University in Washington in 1963-64. In 1965, he received Lalit Kala Akademi’s national award. Prominent honours bestowed upon him include the Padma Shri in 1990, the Lalit Kala Ratna in 2004, and the Padma Bhushan in 2011. He lives in Gurugram.",
    "CurrentProductId": "2151",
    "LastArtProId": "5877",
    "profile": "https://dagworld.com/krishenkhanna.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/r/krishen_khanna_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khannak064.jpg",
            "title": "The Humiliation of Draupadi",
            "year": 1986,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khannak66.jpg",
            "title": "Untitled",
            "year": 1963,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khannak32.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Charcoal on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khannak50.jpg",
            "title": "Untitled",
            "year": 1987,
            "medium": "Oil on linen"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khannak065.jpg",
            "title": "Ominous Brown",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}