{
    "name": "Kshitindranath Majumdar",
    "year": "1891 - 1975",
    "intro": "Kshitindranath Majumdar, born on 31 July 1891 in Jagtai village of Murshidabad in West Bengal, is often referred to as a saint-artist who considered art as a form of devotion.",
    "bio": "Strongly influenced by Vaishnavism as propounded by the fifteenth century saint, Chaitanya Mahaprabhu, Majumdar trained in hymn singing, interpreted legends from Indian epics, and acted in productions of the theatre group owned by his father.\nIt was on the advice of the zamindar of the neighbouring village of Nimtita that Majumdar came to Calcutta and joined the Government Art College in 1905. His paintings reflected the style of his master Abandindranath Tagore; he carried Tagore’s delicate, romantic style further by investing his figures with dresses and drapery that carried suggestions of the Ajanta frescos and Rajput paintings.\nIn 1912, along with Nandalal Bose, Majumdar took over the responsibilities of teaching at the Indian Society of Oriental Art and continued till 1930. Later, at Santiniketan too, he engaged himself with teaching the aesthetic principles inherited from his mentor.\nMajumdar’s subject matter comprised mythological narratives, Puranic stories, and Vaishnav gods and saints. He charged his paintings with his own perception of bhakti (devotion) and aimed at a transcendental expression. One of the most significant Bengal School artists, Majumdar continued the trend of revivalism by evolving an art form rooted in traditional Indian modes of image-making and reflecting the spiritual world.\nAwarded an honorary D.Litt. by Rabindra Bharati University, Calcutta in 1963, the artist passed away in 1975.",
    "CurrentProductId": "2153",
    "LastArtProId": "3163",
    "profile": "https://dagworld.com/kshitindranathmajumdar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/s/kshitindranath_majumdar.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mazumdark26ny.jpg",
            "title": "Expectation",
            "year": 1925,
            "medium": "Watercolour wash highlighted with gold pigment on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mazumdark27ny.jpg",
            "title": "Shri Chaitanya Meets His Mother After Sanyas",
            "year": null,
            "medium": "Watercolour wash on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/mazumdark29.jpg",
            "title": "Untitled (Shiva and Parvati)",
            "year": null,
            "medium": "Tempera on paper pasted on board"
        }
    ]
}