{
    "name": "B. C. Sanyal",
    "year": "1901 - 2003",
    "intro": "Bhabhesh Chandra Sanyal lived a unique life in the world of Indian art, witnessing the huge arc it cut across the twentieth century—he was born when the revivalist Bengal School was beginning to bloom, and by the time he passed away, modern Indian art had gone global and carved an international art market for itself.",
    "bio": "Born in Dhubri in present-day Assam, Sanyal studied at the Government  College of Art, Calcutta, in the Western academic style. Upon graduation, he taught at the Serampore College of Art for six years before being invited to Lahore, in 1929, by a business firm to make a bust of the recently-martyred freedom fighter, Lala Lajpat Rai. Sanyal made Lahore his home and became vice-principal of the Mayo School of Arts. He also set up the Lahore College of Art in 1937.\nSanyal moved to New Delhi upon the partition of India in 1947, where he set up a ‘refugee studio’ at 26, Gole Market, which became the hub of modernist art conversations. He also headed the Delhi Silpi Chakra and was vice chairman of the Lalit Kala Akademi.\nKnown for his sculptures, Sanyal also made paintings in oils, watercolours and tempera, and experimented with silkscreen, portraying everyday life, landscapes, figures and semi-abstract works. Some of his works bore the influence of Amrita Sher-Gil and the Bengal School.\nThe Government of India celebrated his birth centenary by releasing a postage stamp on him. Sanyal passed away in New Delhi on 9 August 2003.",
    "CurrentProductId": "2078",
    "LastArtProId": "2492",
    "profile": "https://dagworld.com/b.c.sanyal.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/c/bc_sanyal_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sanyalbc16.jpg",
            "title": "Untitled",
            "year": 1979,
            "medium": "Watercolour wash and charcoal on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sanyalbc18.jpg",
            "title": "Mask and Man - II",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sanyalbc20.jpg",
            "title": "Shrouded Woman",
            "year": null,
            "medium": "Cement"
        }
    ]
}