{
    "name": "B. Vithal",
    "year": "1935 - 1992",
    "intro": "Born in Maharashtra, B. Vithal took a diploma in sculptural art from Sir J. J. School of Art, Bombay.",
    "bio": "Taking to art with natural ease, he began drawing as early as five years of age, making Ganesha and other popular Hindu deities on his slate using chalk. The inspiration sustained through his entire life, and his work was mainly inspired by Hindu mythology, philosophy, and ancient Indian art.\nVithal’s works are based on aesthetic forms, structures, textures, colours, and compositions, always paying great attention to the demands of technique and craftsmanship and careful about his iconographic rendering. Vithal faced some financial hardship, a time when he worked as a signboard painter and designed mandapas (canopies for weddings or large public festivals) and stages for events to earn a living. These introduced him to a diverse range of mediums and allowed him to understand the plasticity of a tangible medium.\nVithal also experimented with abstraction, retaining, however, the lyricism he felt was vital to a work of art. He worked with a range of mediums like graphite, chalk, watercolour, oil, stone, iron, bronze, aluminium, glass, as well as the new-age material of fibreglass. His focus shifted to sculpture in the mature phase of his career, finding the process of making a sculpture a greater tangible experience when compared to painting.\nHe built his career in Bombay, living with wife and artist B. Prabha, whom he had met while studying at Sir J. J. School of Art.",
    "CurrentProductId": "2345",
    "LastArtProId": "2499",
    "profile": "https://dagworld.com/b-vithal.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/_/b_vithal_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/i/vithalb02.jpg",
            "title": "Untitled",
            "year": 1966,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/i/vithalb08.jpg",
            "title": "Untitled (Horse)",
            "year": null,
            "medium": "Iron"
        }
    ]
}