{
    "name": "Baburao Painter",
    "year": "1890 - 1954",
    "intro": "Born to a family of artists in Kolhapur, Maharashtra, on 3 June 1890, Baburao Painter was a self-taught artist who excelled in both oil painting and sculpture.",
    "bio": "His skill in painting earned him the nickname ‘Painter’. His excellence in traditional sculpture is evident in the large statue he made of Mahatma Gandhi, installed in Kolhapur.\nBaburao’s colour schemes were influenced by the European classical style, lending an air of gentle charm to his works. Gifted but with no formal training, be it working on a lathe, painting, sculpting or designing costumes, the décor for a natak mandali or the drama stage, he excelled at them all and was considered a master artist. In fact, in the early years of the twentieth century, along with his cousin Anandarao, he was the leading painter of stage backdrops in western India, working for Gujarati-Parsi theatre groups.\nThe release of Dada Saheb Phalke’s first film, Raja Harishchandra, in 1913, triggered his interest in films. His career in films started as an assistant to Phalke, and he went on to set up the Maharashtra Film Company in Kolhapur in 1919. He directed more than a dozen films and also acted in a few. It was during the shooting of Gad Aala Pan Sinha Gela, in which he played the role of Shivaji, that he fell off a horse and suffered an injury that tragically impaired his speech for life. He retired in 1946 to Kolhapur, living and painting there until his death on 16 January 1954.",
    "CurrentProductId": "2081",
    "LastArtProId": "2501",
    "profile": "https://dagworld.com/baburaopainter.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/a/baburao_painter.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/painterbr01.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on oil paper pasted on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/painterbr03.jpg",
            "title": "Untitled (Lakshmi)",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}