{
    "name": "Bhupen Khakhar",
    "year": "1934 - 2003",
    "intro": "Recognised as India’s first pop artist, Bhupen Khakhar graduated as a chartered accountant in 1960.",
    "bio": "Khakhar began painting in the early 1960s after joining a course in art criticism at the Faculty of Fine Arts, M. S. University, Baroda, at the behest of the leading Baroda artist Gulammohamed Sheikh.\nKhakhar’s creative endeavours also included writing short stories for Gujarati newspapers. In 1989, Mojila Manilal, a play written and designed by Khakhar, was performed at Bombay, Baroda, and Ahmedabad. He also made a set of eight prints for a limited edition of two stories by Salman Rushdie, Free Radio, and The Prophet. Khakhar’s own story, Phoren Soap, was published with his original etchings in 1998.\nA self-taught painter, Khakhar was known for training his brush on everyday activity and life in middle class neighbourhoods. He made public his homosexual orientation in the 1980s, and gradually, this resulted in his exploration of issues of sexuality within the local Indian context. The narrative nature of his paintings brought to the fore a comic but gentle irony in communicating serious issues of sexuality, middle class morality, and censorship.\nRemembered as an iconoclast and a non-conformist, some of his seminal solo exhibitions include a retrospective at Museo Nacional, Centre de Art, Reina Sofia, in Madrid in 2002, and posthumous retrospectives at National Gallery of Modern Art, Mumbai, in 2003 and at Tate Modern, London, in 2016. Khakhar received the Padma Shri from the Government of India in 1984, and the Prince Claus Award from the Dutch government in 2000.",
    "CurrentProductId": "2346",
    "LastArtProId": "2517",
    "profile": "https://dagworld.com/bhupen-khakhar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/h/bhupen_khakar_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khakharb03.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Etching and aquatint on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khakharb56.jpg",
            "title": "Untitled (Lotus)",
            "year": 1993,
            "medium": "Serigraph on handmade paper"
        }
    ]
}