{
    "name": "L. N. Taskar",
    "year": "1870 - 1937",
    "intro": "Laxman Narain Taskar’s paintings mirror the ideals of academic realism introduced by the British within their art education system.",
    "bio": "Indian artists were trained in naturalism, with lessons in soft effects of chiaroscuro and the three-dimensionality of the external world. History painting, perspective, and the copying of Victorian portraits became a vital ingredient within these art schools.\nIn 1898, Taskar joined Sir J. J. School of Art, Bombay, as a teacher. Adopting the style of objective accuracy, formal order and an interest in visual narration, his paintings concentrated on ‘slices of everyday life’. They became a tool for reflecting upon contemporary reality, where he replaced mythological figures with common people in their local environments.\nThrough vibrant colours, he lucidly portrayed moods of festivities, and local people engaged in rituals and routines. Women were often depicted in familial or community settings, and rarely as private beings. In defiance of the academic norms of the time, Taskar became one of the few artists to paint subjects such as courtesans, as opposed to the usually passive portrayals required of commissioned portraits.\nTaskar made several departures from his rigid academic training in the transparent watercolour technique. Sometimes, his oils adopted the lightness and airiness of his watercolours. The visibility of the pencil drawing underneath enhanced the formal construction of the work, energising the outdoor atmosphere with a soothing lightness. Taskar’s works are part of several collections, the most prominent being that of Sir Ganga Singhji Bahadur, the maharaja of Bikaner.",
    "CurrentProductId": "2155",
    "LastArtProId": "2968",
    "profile": "https://dagworld.com/l.n.taskar.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/l/n/ln_tasker_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/taskarln24.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/taskarln25.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/taskarln35.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/taskarln39.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour and graphite on paper pasted on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/taskarln42.jpg",
            "title": "Untitled (Mughal Gateway)",
            "year": null,
            "medium": "Watercolour on paper"
        }
    ]
}