{
    "name": "Latika Katt",
    "year": "b - 1948",
    "intro": "Growing up in Dehradun, Latika Katt learnt to observe everything closely through the numerous trekking expeditions she took with her botanist father.",
    "bio": "Katt completed her bachelor’s in fine arts from Banaras Hindu University and later completed her master’s from the Faculty of Fine Arts, M. S. University, Baroda, in 1971. Interestingly, hers was the first art degree batch of the prestigious institution and she was the first female student to receive a gold medal in sculpture from the university. Later, in 1981, she received a research scholarship from the Slade School of Art, London.\nGreatly inspired by Auguste Rodin, Katt has even studied corpses closely in pursuit of her art. Her artistic process involves understanding the ‘being’ behind the face. Her sitters have included some of the very well-known artists of Indian modern art such as Ramkinkar Baij and N. S. Bendre, among others.\nIt was in the 1970s that Katt started gaining recognition for experimenting with economically viable materials such as cow dung and paper to create works of art. Her choice of materials has included stone and marble with which she has completed prestigious commissions. She became recognised too for making iconic sculptures of prominent statespersons.\nKatt has received many honours, including the national award from the Lalit Kala Akademi, New Delhi. More recently, she won the Beijing Art Biennale Award for her bronze work titled Makar Sankranti at Dashawmeth Ghat, Varanasi. She taught in the fine arts department of Jamia Millia Islamia University, New Delhi, and continues to divide her time between Delhi and Banaras.",
    "CurrentProductId": "2157",
    "LastArtProId": "2990",
    "profile": "https://dagworld.com/latikakatt.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/l/a/latika_katt_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika006.jpg",
            "title": "Sugarcane Field",
            "year": 2010,
            "medium": "Resin and papier-mâché"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika01.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Glazed stoneware"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika004.jpg",
            "title": "Sati",
            "year": 1993,
            "medium": "Papier-mâché, white clay, bamboo, iron rod structure, organic preservatives and resin"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika014.jpg",
            "title": "Fields",
            "year": 2008,
            "medium": "Papier-mâché"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika018.jpg",
            "title": "Untitled (Tree)",
            "year": null,
            "medium": "Terracotta"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/a/kattlatika043.jpg",
            "title": "Roots (White Stone)",
            "year": 2011,
            "medium": "Glazed stoneware"
        }
    ]
}