{
    "name": "P. Khemraj",
    "year": "1934 - 2000",
    "intro": "Hailing from an artistic family based in Bombay, P. Khemraj was fascinated with manifestations of beauty in every aspect of life.",
    "bio": "On completion of his training in drawing and painting at Sir J. J. School of Art, Bombay, Khemraj, a fine violinist, left for New Delhi to learn the sitar from Pandit Ravi Shankar.\nIn his early years, Khemraj was influenced by senior artists S. B. Palsikar and A. A. Almelkar. A three-year government scholarship for studies in France, from 1962 to 1965, exposed the young artist to new styles and techniques. He studied with Atelier 17’s Stanley William Hayter, the father of modern printmaking, Krishna Reddy, a pioneer in the field of simultaneous multi-coloured prints, and other cubist, impressionist, expressionist and surrealist artists, learning to express formations using line as a life-force.\nUpon his return from Paris, Khemraj began evolving an abstract signature style that he tried in acrylic or mixed media on mount board. His affinity to medieval and modern Western art movements and love for his own roots were inspirational in creating a fine balance between the two worlds. His series Hatheli, Charpai, Prithvi, Heart, and the powerful drawings called Singing Lines, were born from real-life encounters and the artist’s spontaneous zest for life. His rendition of birds and flowers indicated Khemraj’s conviction that life was a gift to revel in. In his last phase, his artistic expressions were those of an ancient philosopher and seer.",
    "CurrentProductId": "2190",
    "LastArtProId": "5879",
    "profile": "https://dagworld.com/p.khemraj.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/_/p_khemraj_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khemrajp146.jpg",
            "title": "Untitled (Charpai)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khemrajp028_1.jpg",
            "title": "Untitled",
            "year": 1991,
            "medium": "Acrylic and ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khemrajp052.jpg",
            "title": "Untitled",
            "year": 1986,
            "medium": "Acrylic and ink on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khemrajp158.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Acrylic, ink and gold pigment on ivory sheet pasted on fabric pasted on plywood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/h/khemrajp015.jpg",
            "title": "Untitled",
            "year": 1992,
            "medium": "Acrylic and gold pigment on ivory sheet pasted on plywood"
        }
    ]
}