{
    "name": "Paramjit Singh",
    "year": "b - 1935",
    "intro": "Close association with nature during Paramjit Singh's growing years, and reading art books in the library of Khalsa College, New Delhi, where his grandfather was-senior vice principal, had a profound influence on him, leading to his emergence as a landscape painter.",
    "bio": "Born in Amritsar on 23 February 1935, he studied art at Delhi Polytechnic from where he completed a diploma in 1958. About a decade later, he went to Norway to study printmaking at Atelier Nord.\nSuperbly rendered hues and masterly brushstrokes lend a unique luminosity to his dense and mystic landscapes, which range from purely realistic to abstract, evolving in three different phases.\nThe first phase was his art school period, when he began painting landscapes, with an active interest in portraiture and figuration. In the second phase, he painted still-lifes and landscapes, and the third comprised mainly landscapes that show experimentation with techniques. Singh’s mature works feature an orchestration of colour and light in rugged hills, boulders, trees and sky. Over the past decade, he also created a body of charcoal crayon on paper landscapes, quite like the bleached versions of his signature coloured works.\nSingh held his first solo show at Triveni Kala Sangam in 1967, and has exhibited extensively since then. He received the Lalit Kala Akademi’s national award in 1970. Singh lives and works in New Delhi with his artist wife, Arpita Singh, one of the doyennes of modern Indian art.",
    "CurrentProductId": "2193",
    "LastArtProId": "2639",
    "profile": "https://dagworld.com/paramjitsingh.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/paramjit_singh.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhp017.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhp018.jpg",
            "title": "Untitled (Moonlight..)",
            "year": 1984,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/i/singhp023ny.jpg",
            "title": "Woods",
            "year": 2007,
            "medium": "Etching on paper"
        }
    ]
}