{
    "name": "Paritosh Sen",
    "year": "1918 - 2008",
    "intro": "Drawn to art through the pages of the Bengali art journal Prabasi, Paritosh Sen ran away from his home in Dacca (Dhaka), now in Bangladesh, to learn art in Madras.",
    "bio": "Uninfluenced by the European modern art trends till the 1940s, Sen experimented with a vocabulary drawn from Indian idioms. Exposure to the works of Vincent van Gogh, Paul Cézanne, Paul Gaugin, and other masters, through their reproductions during his teaching years at Art College, Indore, sparked off Sen’s interest in form. In 1942, he participated in the only exhibition of the Calcutta Group, of which he was a founder member.\nHowever, it was Sen’s visit to Paris in 1949 that saw him formally acquainted with European art; he also met Pablo Picasso on this trip. Sen returned to India in 1954 and subsequently made paintings with themes from everyday life. His spontaneous response to the traumatic socio-political changes in West Bengal in the 1970s resulted in a series, where, along with large canvases, he installed a papier-mâché sculpture conveying a poster-like simplification of pop art, inspired by his travels in Mexico and Egypt.\nSen wrote on art for leading English and Bengali journals. In 1986, he wrote and illustrated a story in English, published by National Institute of Design, Ahmedabad. The French government conferred on him the L’officier de l’ordre des arts et des lettres and the Lalit Kala Akademi honoured him with the title of Lalit Kala Ratna in 2004. He passed away on 22 October 2008 in Kolkata.",
    "CurrentProductId": "2194",
    "LastArtProId": "4382",
    "profile": "https://dagworld.com/paritoshsen.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/a/pasritosh_s_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp079.jpg",
            "title": "Self-portrait with Pipe",
            "year": 1948,
            "medium": "Dry pastel on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp083ny.jpg",
            "title": "Untitled (Portrait Cubist de Femme a la Cruche)",
            "year": 1952,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp89ny.jpg",
            "title": "Untitled (Isabelle in Black Dress)",
            "year": 1982,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp43.jpg",
            "title": "Women at a Sacred Tank",
            "year": 1989,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp52_1.jpg",
            "title": "Head",
            "year": 1969,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/e/senp70.jpg",
            "title": "Untitled",
            "year": 1983,
            "medium": "Charcoal on paper"
        }
    ]
}