{
    "name": "Pestonji E. Bomanji",
    "year": "1851 - 1938",
    "intro": "One of few gentleman aristocrat painters trained in academic realism at a time when art students were expected to fund their own materials for learning, Pestonji E. Bomanji's subject matter was mostly ethnographic and remained limited to the Parsi community to which he belonged, depicting their life with easily available and willing models. He made a name for himself in oil portraiture.",
    "bio": "Born in Bombay, he joined Sir J. J. School of Art at the age of thirteen. While there, the principal, John Griffiths, identified his talent and appointed him a draughtsman on an expedition to the Ajanta caves in 1872, which he came to head in 1880. Though Bomanji initially wanted to be a sculptor, his interest in portraiture was triggered after 1877, when Griffiths recommended him as an apprentice to Valentine Prinsep, a visiting artist; he went on to train under John Lockwood Kipling.\nWith Griffith’s encouragement, Bomanji exhibited at shows around the country, winning several important prizes such as the Governor’s gold medal at Madras, Pune, and Calcutta, and a cash prize at the 1883 International Exhibition at Calcutta. Bomanji’s works are often compared to that of Dutch artists for their unflattering realism, even once acknowledged as the ‘Indian Rembrandt’. His works are part of collections such as Prince of Wales Museum (now Chhatrapati Shivaji Maharaj Vastu Sangrahalaya) in Bombay, National Gallery of Modern Art in New Delhi, the Tata Family Collection, and Indian Museum in South Kensington. He went on to be the first Indian vice-principal of Sir J. J. School of Art, Bombay.",
    "CurrentProductId": "2362",
    "LastArtProId": "5831",
    "profile": "https://dagworld.com/pestonji-e-bomanji.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/e/pestonji_bomanji.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/o/bomanjip010.jpg",
            "title": "Untitled",
            "year": null,
            "medium": ""
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/o/bomanjip09.jpg",
            "title": "Dhobi Talao",
            "year": 1898,
            "medium": "Oil on oil paper pasted on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/b/o/bomanjip06.jpg",
            "title": "Untitled (Portrait of a Parsi Lady)",
            "year": 1914,
            "medium": "Oil on canvas"
        }
    ]
}