{
    "name": "Piraji Sagara",
    "year": "1931 - 2014",
    "intro": "An early Indian abstractionist who forged his own vocabulary, distinct from the dominant forces that gripped India’s art community in the early years of Independence, Piraji Sagara came to be known for his collages made of wood relief amalgamated with abstract paintings.",
    "bio": "A sculptor and painter, Sagara was born in Ahmedabad on 2 February 1931, in a family of traditional wood carvers. He fused modern perception of abstraction with his ancestral knowledge of the material. With a natural flair for drawing, he completed a master’s in drawing in 1957 and a master’s in arts in 1960 from Sir J. J. School of Art, Bombay.\nSagara brought together watercolour, pastel, relief work, ornamental scraps, glass bead fragments, and metal, on his burnt wood sculptures, creating narratives that drew from his cultural heritage. For Sagara, the materiality of the work was as seminal as the narrative that the sum of the parts constructed. Inspired by folk culture, he explored the relationship of man with his environment, and the chaos and contradictions of life.\nSagara taught art at School of Architecture, C.E.P.T. University, Ahmedabad, from 1963 until his retirement. He participated in the Sao Paulo Biennale of 1971, Asian art show at Fukuoka Museum of Art, Tokyo, in 1979-80, and the 12th International Festival of Painters at Cagnes-sur-Mer in France, among other international shows. He received Lalit Kala Akademi’s national award in 1963. He passed away on 23 January 2014 in Ahmedabad.",
    "CurrentProductId": "2196",
    "LastArtProId": "2655",
    "profile": "https://dagworld.com/pirajisagara.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/i/piraji_sagara.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sagarap010.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Wood, iron nail, enamel and beads on plywood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sagarap011.jpg",
            "title": "Untitled",
            "year": 1964,
            "medium": "Enamel, encaustic and wood on ply board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sagarap013.jpg",
            "title": "Untitled",
            "year": 1972,
            "medium": "Enamel and metal on enamelled plywood"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/a/sagarap06.jpg",
            "title": "Untitled",
            "year": 1978,
            "medium": "Mixed media on ply board"
        }
    ]
}