{
    "name": "Prabhakar Kolte",
    "year": "b - 1946",
    "intro": "The search for abstraction in Indian art in the early years of Independence was born out of a desire among artists to attain an independent idiom of modernism. Rooted in the country’s philosophical and religious aesthetic, Prabhakar Kolte is among the leading practitioners engaged in this quest.",
    "bio": "A master of poetic and metaphysical abstractionism, Kolte received a diploma in painting from Sir J. J. School of Art, Bombay, in 1968. Initially, he freelanced as an illustrator, also working as a designer at Bombay Dyeing.\nKolte’s early works bore a strong influence of Paul Klee and his lyrical line. Like Klee, Kolte too found his inspiration in nature—he attempted to paint like nature, relying on his intuition as opposed to imitating nature or drawing from it.\nPainting is highly meditative for Kolte, and he draws inspiration from the commentary on the Bhagvad Gita by the thirteenth century Marathi saint Dnyaneshwar. He eliminates anything representational on his canvases that are instead made up of layers of dripping paint. His work is often dominated by a single hue, like a symphony in colour that hides and reveals layers, and in which architectural or landscape-related forms are sometimes discernible. He experimented with installation and performance art in the early 1980s.\nKolte taught at his alma mater from 1974-94 before quitting to pursue painting fulltime. His first group show was at the Lalit Kala Akademi, New Delhi, in 1972, to mark the silver jubilee of India’s Independence. Kolte lives and works in Mumbai.",
    "CurrentProductId": "2197",
    "LastArtProId": "2676",
    "profile": "https://dagworld.com/prabhakarkolte.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/r/prabhakar_kolte.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/o/koltep04.jpg",
            "title": "Untitled",
            "year": 1986,
            "medium": "Acrylic on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/o/koltep08.jpg",
            "title": "Untitled",
            "year": 2007,
            "medium": "Watercolour on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/o/koltep09.jpg",
            "title": "Untitled",
            "year": 2006,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/o/koltep11.jpg",
            "title": "Untitled",
            "year": 2005,
            "medium": "Acrylic on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/o/koltep12.jpg",
            "title": "Untitled",
            "year": 2002,
            "medium": "Watercolour on handmade paper"
        }
    ]
}