{
    "name": "Prodosh Das Gupta",
    "year": "1912 - 1991",
    "intro": "Prodosh Das Gupta searched for a sculptural form that would express contemporary ideas while preserving prana—the inherent life-force of traditional Indian sculpture.",
    "bio": "Born in Dacca (now Dhaka) in present-day Bangladesh, he studied sculpture under Hiranmoy Roy Chowdhary at the Lucknow School of Arts and Crafts (1932-33), and under D. P. Roy Chowdhury at Government School of Art and Craft, Madras (1933-37). Over the next two years, he studied bronze casting at LCC Central School, London, and sculpture at Royal Academy of Arts, London, and Académie de la Grande Chaumière, Paris. He returned to India in 1940 and set up his studio in Calcutta. He subsequently taught at M. S. University, Baroda, and at Calcutta’s Government College of Arts and Crafts.\nFor his realistic and abstract figures, he found inspiration in the fluid rhythm and gliding forms of masters such as Auguste Rodin, Constantin Brâncuși, Jean Arp, and Henry Moore. He famously experimented with instant sculpture, done in a few minutes.\nHe was a founding member of Calcutta Group of artists in 1943—one of the earliest groupings of modern Indian artists. As curator of the National Gallery of Modern Art, New Delhi, from 1957-70, he acquired works for the institution by seminal contemporaries such as M. F. Husain, Tyeb Mehta, F. N. Souza, Ram Kumar, and A. Ramachandran. He exhibited widely in his lifetime and important posthumous exhibitions of his work have been held after his death in 1991, including a retrospective at National Gallery of Modern Art, New Delhi, in 2008.",
    "CurrentProductId": "2198",
    "LastArtProId": "2695",
    "profile": "https://dagworld.com/prodoshdasgupta.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/r/prodosh_dasgupta_cover_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dasguptap027.jpg",
            "title": "Mother and Child (Egg Series)",
            "year": 1971,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dasguptap033.jpg",
            "title": "Queen Relaxing",
            "year": 1986,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dasguptap041.jpg",
            "title": "Genesis II",
            "year": 1982,
            "medium": "Bronze"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/d/a/dasguptap043ny.jpg",
            "title": "Suryamukhi",
            "year": 1978,
            "medium": "Bronze on wooden pedestal"
        }
    ]
}