{
    "name": "Prosanto Roy",
    "year": "1908 - 1973",
    "intro": "Nature, old Calcutta, people, their preoccupations, and episodes from Oriental narratives formed Prosanto Roy's subjects, as well as a response on the horrific events of his time, such as the dropping of the atomic bomb on Hiroshima on 6 August 1945.",
    "bio": "Born on 25 April 1908, he joined Brahmacharya Ashram at the age of thirteen, under Rabindranath Tagore’s tutelage. He took to art at a young age, copying the paintings of the great masters. After initial training in art under a European teacher, Roy joined the Tagore residence at Jorasanko in the 1920s. Groomed by Gaganendranath and Abanindranath Tagore, he worked on stage design and illustrated student magazines.\nRoy’s initial inspiration was the Bengal School style of which he went on to become an exponent, known for his layers of delicate washes which he merged with a later, cubist language. Working with the wash technique, Roy brought architectural details into his painting in the manner of Indian miniature paintings. Using Chinese ink, he could create intense proliferation of tonal degrees and gradations. He applied warm pigments and expanded them with cool tonalities, thus creating a vibrant pictorial space. Also interested in carpentry and photography, Roy became curator of Kala Bhavana Museum, Santiniketan, in 1952.\nHis first solo show was held in New Delhi in 1951-52, followed by shows in Bombay, Gwalior, Lucknow, and several in Calcutta. He exhibited for the last time in Calcutta in 1971 and passed away on 19 December 1973.",
    "CurrentProductId": "2200",
    "LastArtProId": "4297",
    "profile": "https://dagworld.com/prosantoroy.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/p/r/prosanto_roy_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp02.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour wash on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp61.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Ink on paper pasted on mount board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp63ny.jpg",
            "title": "Untitled (Deepavali)",
            "year": 1954,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp64.jpg",
            "title": "Pleasure Boat",
            "year": 1931,
            "medium": "Watercolour wash on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp65.jpg",
            "title": "Untitled",
            "year": 1955,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/r/o/royp66.jpg",
            "title": "Falwala",
            "year": 1964,
            "medium": "Watercolour and ink on paper"
        }
    ]
}