{
    "name": "Nalini Malani",
    "year": "b - 1946",
    "intro": "Born in Karachi, a year before it became part of Pakistan, Nalini Malani’s art, unsurprisingly, is built on observing the struggles and strife of people, socio-political changes, and how she observes this.",
    "bio": "More recently, the lockdown in India on account of the corona pandemic and its impact on migrant workers has impacted her work, even prompting her to post short animations on social media platforms.\nMalani graduated from Sir J. J School of Art, Bombay, in 1969. Interestingly, she began experimenting with new media early in her career. In the same year that she graduated, Malani created a series of colour, stop-motion films called Dream Houses. Later, in the 1970s, studying in École Nationale Supérieure des Beaux Arts in Paris, Malani was able to gain a new perspective about her own motherland.\nLearning the technique of reverse painting from master artist Bhupen Khakhar in the ’80s allowed her to understand how to create a strong sense of character in her figurative work. She did illustrations for The Times of India wherein she delved deeply into Indian mythology, and many of her works from the Stories Retold series probably reflect her days as an illustrator in the publication.\nAn internationally acclaimed artist, Malani’s solo exhibitions have been held at most prestigious locations, including Institute of Contemporary Art, Boston (2016) and the Centre Pompidou in Paris—the first living Indian artist to have a show there —and Stedelijk Museum, Amsterdam (both 2017), to name some. In 2020, Malani’s installation, Can You Hear Me?, opened to the public at Whitechapel Gallery in London. The same year she became the first Indian to receive a two-year research fellowship in contemporary art awarded by London’s National Gallery. The Kiran Nadar Museum of Art, New Delhi, organised her retrospective across three shows in 2014.\nThe artist divides her time between Mumbai and Amsterdam, continuing to work actively from both cities.",
    "CurrentProductId": "2181",
    "LastArtProId": "2934",
    "profile": "https://dagworld.com/nalininalani.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/nalini_malani.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/malanin21_1_.jpg",
            "title": "Laying a Cable",
            "year": 1983,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/malanin25.jpg",
            "title": "Child Performer I",
            "year": 1975,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/malanin26ny_front_1.jpg",
            "title": "Untitled (Women Series)",
            "year": 1974,
            "medium": "Oil on canvas"
        }
    ]
}