{
    "name": "Nataraj Sharma",
    "year": "b - 1958",
    "intro": "For a socially responsive artist like Nataraj Sharma, the frenzied pace of change in contemporary times coupled with his upbringing in vastly different cultural milieus of India, Egypt, England, and Zambia, has proved to be the proverbial grist for his art mill.",
    "bio": "An inter-disciplinary artist, Sharma was born in Mysore in 1958 and graduated in applied art from M. S. University, Baroda, in 1982. He expresses his observances of the socio-political and cultural dynamics around him through paintings, prints, installations, and digital art, in a vocabulary that is bold and individualised. Yet, one comes across the influence of Andy Warhol’s pop art and Marcel Duchamp’s Dadaism occasionally. Whether figure studies, portraits, landscapes in acrylic or oil, or large-scale installations, Sharma seems to be at ease with it all.\nUnrestrained construction activity across India in the past few decades has been an important trope in Sharma’s art. By presenting dense vistas of residential and industrial construction activity devoid of human figures, he makes a stark, haunting comment on the soullessness of the enterprise, as also on the future of humankind based on such gargantuan activities. Often, he presents a mocking version of the world around him, thereby conveying harsh truths with a dollop of humour. The titles of his works are equally merciless as is evident from Hierarchical Arselickers (2003-04) or Adani Thermal Power Plant (2020).\nSharma has participated in several group shows and held solo shows in Delhi, Mumbai, Singapore and Geneva among other venues. The artist lives and works between Baroda and Goa.",
    "CurrentProductId": "2359",
    "LastArtProId": "2941",
    "profile": "https://dagworld.com/nataraj-sharma.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/natraj_sharma.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/sharmanataraj01.jpg",
            "title": "Playground",
            "year": 2002,
            "medium": "Acrylic, plaster and computer graphics on paper pasted on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/sharmanataraj05.jpg",
            "title": "Still-life, Machine Parts",
            "year": 1996,
            "medium": "Oil on oil paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/h/sharmanataraj07.jpg",
            "title": "Roadmaker (Triptych)",
            "year": null,
            "medium": "Oil, acrylic and charcoal on oil paper and canvas"
        }
    ]
}