{
    "name": "Navjot",
    "year": "b - 1949",
    "intro": "A painter, sculptor, installation artist, and filmmaker inspired by Marxist ideologies, Navjot Altaf has consciously questioned various frameworks of social norms and created art to bring focus to the plight of the depressed classes.",
    "bio": "Born in Meerut, she studied fine and applied arts at Sir J. J. School of Art, Bombay, from 1967-72. She has travelled extensively across continents in her quest for empowering people; through her art, her writings, and films, she has addressed a variety of issues—social inequality, political repression, gender, and sexuality. In the 1970s, she was also associated with the Progressive Youth Movement (Proyom). Navjot maps the trajectories of memory, history and culture, interrogating ‘body politics’, seeing the self as a source of knowledge. She articulates her own experience to address issues related to the social, the political, and the artistic.\nIn 1997, she met tribal artists from Bastar in central India, viz., Rajkumar Korram, Shantibai, and Gessuram Vishwakarma, and founded Dialogue Interactive Artists Association to create a ground for dialogue between tribal and urban artists to work side-by-side. They have created many artistic projects in collaboration since then.\nNavjot brings her wide experience and exposure to her craft, having travelled and shown her work extensively and gained from art practices in England, Brazil, Germany, The Netherlands, Japan, and U.S.A. She explores various materials and mediums in her work.\nShe married fellow artist Altaf in 1972 and the two held several joint exhibitions till his passing in 2005. Navjot continues to live and work in Mumbai.",
    "CurrentProductId": "2185",
    "LastArtProId": "5866",
    "profile": "https://dagworld.com/navjot.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjyot.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot24_1_.jpg",
            "title": "December 15th 2000",
            "year": 2008,
            "medium": "Duco paint on fibreglass with vulcanized rubber tube"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot035.jpg",
            "title": "Untitled (Squeezed II)",
            "year": 1978,
            "medium": "Ink on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot20.jpg",
            "title": "Untitled",
            "year": 1989,
            "medium": "Oil, charcoal and pastel on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot50.jpg",
            "title": "Tribute to Painters I Admire",
            "year": 1992,
            "medium": "Acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot51.jpg",
            "title": "Untitled",
            "year": 1973,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/n/a/navjot42.jpg",
            "title": "Untitled",
            "year": 1997,
            "medium": "Indigo pigment on wood"
        }
    ]
}