{
    "name": "V. A. Mali",
    "year": "1911 - 2011",
    "intro": "Vasant Anant Mali’s work had a forcefulness, a depth that was unique and could be seen, particularly, in portraits done by him.",
    "bio": "Born into a family of painters in Kolhapur, Mali studied art professionally at Sir J. J. School of Art, Bombay, in the 1920s. It was here that he grasped the nuances of painting through academic realism. Working mostly in the medium of watercolour and oil, Mali keenly observed how some of his teachers, including Walter Langhammer, worked with various tools and applied bold brushstrokes with knife.\nRegarded as one of the highest paid portrait painters of his time, he was renowned for his art and commissioned by many industrialists, statespersons, and other known personalities. What made his portraits stand out was the uniqueness in studying his subjects closely and having the ability to capture every detail on the canvas. Besides these commissions, Mali often projected common people—sadhus, roadside vendors, street musicians, and artistes—in his work, compelling viewers to become a part of their lives.\nAn active member of Art Society of India, he was friends with artists such as N. S. Bendre, S. L. Haldankar, V. P. Karmakar, among others. Winning several accolades during his lifetime, Mali was conferred Roopdhara—‘lifetime achievement award’—by Bombay Art Society in 2005. The centenarian’s work has been part of collections of prestigious museums, including Victoria Memorial, Kolkata, Baroda Museum, and India House, London.",
    "CurrentProductId": "2251",
    "LastArtProId": "3035",
    "profile": "https://dagworld.com/v.a.mali.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/va_mali_1.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maliva017.jpg",
            "title": "A Study from Life",
            "year": 1932,
            "medium": "Pastel on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maliva018.jpg",
            "title": "Portrait of Baburao Painter",
            "year": null,
            "medium": "Oil on Masonite board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maliva02.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maliva03.jpg",
            "title": "Untitled (Portrait of Squadron Leader Kamal Anand)",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/m/a/maliva014.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}