{
    "name": "V. S. Gaitonde",
    "year": "1924 - 2001",
    "intro": "One of India’s most revered artists, Vasudeo Santu Gaitonde preferred the term ‘non-objective’ painter over ‘abstraction.’ He was born in Nagpur in 1924.",
    "bio": "He received his diploma in painting from Sir J. J. School of Art, Bombay, in 1948. Impressed by his work, the members of the Progressive Artists’ Group—formed in 1947—pulled him into their meetings. The strength of his talent was soon recognised elsewhere—he won the first prize of the Young Asian Artists Association in Tokyo in 1957, and a John D. Rockefeller III Fund fellowship in 1964.\nThe textural structure with the interplay of colour is the central conductive device in Gaitonde’s paintings. His compositions, inspired by Zen philosophy, possess a kinetic power that imparts movement to his delicately balanced configurations. For Gaitonde, art began in an intensity that moved steadily towards refining itself, even as it explored the artist’s inward spaces and momentary realities. Gaitonde used a roller and a palette knife to influence and mix different mediums on canvas.\nThough Gaitonde was awarded the Padma Shri by the Government of India in 1971, his real success came after his death. The Solomon R. Guggenheim Museum in New York organised a large exhibition of his works posthumously in 2014-15, while the Chhatrapati Shivaji Maharaj Vastu Sangrahalaya, Mumbai, organised another one in 2019. He was among the first Indian modernists whose works created high value at auctions; they continue to enjoy that position. Gaitonde passed away on 10 August 2001 in New Delhi.",
    "CurrentProductId": "2253",
    "LastArtProId": "3002",
    "profile": "https://dagworld.com/v.s.gaitonde.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/s/vs_gaitonde_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gaitondevs59.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Serigraph on handmade paper pasted on handmade paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gaitondevs74.jpg",
            "title": "Garden",
            "year": 1958,
            "medium": "Lithograph on paper"
        }
    ]
}