{
    "name": "Vasundhara Tewari Broota",
    "year": "b - 1955",
    "intro": "In Vasundhara Tewari Broota’s practice, the woman is celebrated as a strong force, a ‘subject’ to be understood at a deeper level.",
    "bio": "Broota studied English literature from Delhi University, did a year of law studies, and pursued art studies from Triveni Kala Sangam, New Delhi. From using palette knives, rollers, even silver leaf, Broota’s techniques have emerged from an intense creative struggle that she has experienced as an artist.\nBroota started painting the nude form in the 1980s, celebrating the feminine force in her art, ensuring that the woman in her work broke away from the shackles of patriarchy, seen as ‘human beings’ who had ‘agency’.\nCelebrated as one of India’s finest contemporary figurative artists, Broota has participated in prestigious exhibitions around the world, including ‘Contemporary Indian Art’, Tokyo (1984); the first biennale at Bharat Bhavan, Bhopal (1986); the second biennial of Havana International Exhibition of Contemporary Art (1986); the sixth International Triennale India, New Delhi (1989). In 1987, Broota’s work was selected for the exhibition, ‘Indian Women Artists’ at National Gallery of Modern Arts, Algiers as  well as the Festival of India in Russia.\nA recipient of several awards, in 1992 she co-directed Shabash Bete with Rameshwar Broota, a film that was screened at Oberhausen Short Film Festival, Germany. Collected widely, Broota’s works are in public and private collections in India and abroad, including National Gallery of Modern Art, New Delhi, Lalit Kala Akademi, New Delhi, Bharat Bhavan, Bhopal, Museum of Modern Art, San Francisco, Chester and David Herwitz Collection, U.S.A., Masanori Fukuoka Collection, Japan, among others. The artist lives and works in New Delhi.",
    "CurrentProductId": "2256",
    "LastArtProId": "3016",
    "profile": "https://dagworld.com/vasundharatewaribroota.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasundhara_broota.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasundharat011.jpg",
            "title": "To and Fro",
            "year": 2009,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasundharat016.jpg",
            "title": "Amazon I",
            "year": 1987,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasundharat022.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasundharat025.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil, enamel and silver pigment on canvas"
        }
    ]
}