{
    "name": "Vasudha Thozur",
    "year": "b - 1956",
    "intro": "Vasudha Thozhur is known for her conscious art practice that seeks to give expression to conflicts which humans encounter daily in a tension-ridden contemporary society.",
    "bio": "Born in Mysore on 14 October 1956, Thozhur received a diploma in painting from the College of Art and Craft, Madras, in 1972. She received a post diploma in painting from Croydon School of Art and Design, U.K., in 1982.\nPrimarily a painter, Thozhur creates works across mediums, comprising drawing, video, digital prints, and spoken and written text. Her works are bold, not just in content but also in colours as stark reds are juxtaposed against cavernous blacks, neon yellows and psychedelic greens. At the same time, some works convey her message in black-and-white.\nConstantly seeking to respond to her social environment, Thozhur collaborated with Himmat, an organisation based in Ahmedabad, where she worked with girls who had lost family members in the 2002 Gujarat riots. She taught them painting, silkscreen printing, photography, video, embroidery, appliqué, and batik, and created an exhibition featuring their work along with her own charged paintings that was displayed in 2013.\nThozhur’s work has been shown at exhibitions at important venues such as Chicago Cultural Centre, Kunstmuseum Bern in Switzerland, World Social Forum in Nairobi, Museo Tamayo in Mexico City, and Asia Society and Queens Museum of Art in New York, among other places. She is currently a professor at Shiv Nadar University, Noida.",
    "CurrentProductId": "2255",
    "LastArtProId": "3012",
    "profile": "https://dagworld.com/vasudhathozur.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/v/a/vasudha_thozur.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thozhurvasudha01.jpg",
            "title": "Of Cages and Shrines or Still life with Cat and Bananas",
            "year": 1991,
            "medium": "Oil and acrylic on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thozhurvasudha03.jpg",
            "title": "A War Time Odyssey (Diptych)",
            "year": 1991,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thozhurvasudha13.jpg",
            "title": "Man with Dog",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/h/thozhurvasudha16.jpg",
            "title": "Still Life with Head Encased",
            "year": null,
            "medium": "Oil on canvas"
        }
    ]
}