{
    "name": "Gaganendranath Tagore",
    "year": "1867 - 1938",
    "intro": "The true pioneer of cubism in India and acclaimed for his satirical works of art, Gaganendranath Tagore was born on 17 September 1867.",
    "bio": "Along with his Nobel-laureate uncle Rabindranath Tagore, and brother Abanindranath Tagore, he was at the forefront of cultural revival in Bengal in the early twentieth century; the brothers established the Indian Society of Oriental Art, Calcutta, in 1907.\nA self-taught artist, Tagore began painting late, at the age of thirty-eight. He learnt Japanese brushwork from visiting Japanese artists at Santiniketan. Initially, he painted Puri landscapes, portraits and other figurative sketches, scenes of Calcutta and illustrations for Rabindranath Tagore’s My Reminiscences, consisting of early known works Sibu Kirtania and Crows. In 1914, six of his paintings were sent to London, and then to the Pavilion Marson exhibition in Paris. Following this, cubism was introduced in his works. From 1917, he also published portfolios of cartoons, titled Birupa Bajra, Adbhut Lok, and Baba Hullod, which were merciless satires on contemporary Bengal society.\nHe was also the driving force behind the Vichitra club at the Tagore residence, even acquiring a lithographic press for it. He tried his hand—to enormous success—at each popular style of painting—watercolour landscapes, haunting night scenes, several Bengal School washes and Japanese brushwork.\nHis 1923 exhibition in Berlin and Hamburg received praise from German critics. He used form as a medium to communicate his feelings, and emphasised the structural quality in his works through semi-abstraction.\nTagore passed away on 14 February 1938.",
    "CurrentProductId": "2109",
    "LastArtProId": "5892",
    "profile": "https://dagworld.com/gaganendranathtagore.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/a/gaganendranath_tagore_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/tagoreg32.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/tagoreg58_1_.jpg",
            "title": "\"Colour\" International Scientific Series",
            "year": null,
            "medium": "Watercolour on card"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/tagoreg69.jpg",
            "title": "Swapanacharani",
            "year": null,
            "medium": "Ink on paper pasted on rice paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/tagoreg66.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Watercolour and gold pigment on cardboard"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/t/a/tagoreg31.jpg",
            "title": "Untitled",
            "year": 1921,
            "medium": "Watercolour on paper pasted on mount board"
        }
    ]
}