{
    "name": "George Chinnery",
    "year": "1774 - 1852",
    "intro": "English painter George Chinnery, who spent almost his entire career in the East and is today celebrated for his Oriental pictures of idyllic, daily scenes from India and China, was born in London on 7 January 1774.",
    "bio": "Chinnery trained at London’s Royal Academy Schools, where one of England’s greatest landscapists, J. M. W. Turner, was a contemporary. At the age of twenty-two, Chinnery went to Dublin to establish his career and attained early success. He married his landlord’s daughter, Marianne, but sailed for India in 1802 to seek portrait commissions, leaving his wife and two children behind. \n Within a decade of arriving in India, Chinnery established himself as a leading English artist, making handsome profits by creating portraits of Indian and Western patrons in Calcutta. Though he was financially successful as an artist, he was a spendthrift too, and ran up debts, which forced him to leave India in 1825 and settle down in Macao. In Macao, made cosmopolitan by the population of Portuguese, other European and North American merchants, Chinnery settled well, finding clients and friends. He made portraits of the leading Chinese merchants, as also of Westerners and Parsis, many of whom were leaders of tea, cotton and opium trades. \n Chinnery never returned to India or to Britain (his wife had eventually followed him to India), enjoying artistic success in Macao, Canton (present-day Guangzhou), and Hong Kong. His works are in important private and public collections around the world, including the Museum of Macao and the Macao Museum of Art. He passed away in Macao on 30 May 1852.",
    "CurrentProductId": "5339",
    "LastArtProId": "5570",
    "profile": "https://dagworld.com/george-chinnery.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/e/george_chinnery.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chinneryg0004.jpg",
            "title": "Figures by a Tomb in Bengal",
            "year": null,
            "medium": "Watercolour and graphite on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chinneryg0009.jpeg",
            "title": "Untitled (A Figure by a Ruined Building with a Minaret, Bengal, India)",
            "year": null,
            "medium": "Watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/c/h/chinnerygeorge002.jpeg",
            "title": "Jhansi Fort on the Ganges",
            "year": null,
            "medium": "Watercolour on paper"
        }
    ]
}