{
    "name": "George Keyt",
    "year": "1901 - 1993",
    "intro": "Born into a prosperous Ceylonese family of Indo-Dutch origin, George Keyt spent his childhood in an environment where Buddhist, Hindu, Muslim, and European cultures commingled, a premise that would later appear in his work.",
    "bio": "A self-taught artist, Keyt’s success was unparalleled with many celebrities such as actor Vivian Leigh, writer Evelyn Waugh, poet Pablo Neruda, and photographer Henri Cartier-Bresson, among others, visiting him, his art, his exhibitions.\nAt the age of twenty-six, Keyt started painting seriously, and through the 1930s he depicted episodes from the Buddhist Jataka tales, even representing Buddha’s life and times on the walls of the circumambulatory shrine room of Gothami Viharaya in Borella, Colombo. Keyt’s attraction to the European style—first Cezanne, and later cubism, especially Picasso’s crisp lines and structural rendering of forms—added an impetus to his Puranic and Buddhist narratives, and Indian erotic iconography, which he often depicted in his art.\nA member of ’43 Group, a modern art collective formed in Colombo by a group of young, pro-independence painters who were committed to promoting a Sri Lankan form of modernism, Keyt’s commitment to free expression gave his art its greatest merit: courage. Art critic Rudy von Leyden, reviewing Keyt’s works in the 1940s, noted: ‘If he speaks the language of Picasso, he does so in a rich and meaningful idiom of his own.’ Because of his interest in Hindu mythology and multiple visits to India, his work is as well regarded here as in his native Sri Lanka.",
    "CurrentProductId": "2112",
    "LastArtProId": "5820",
    "profile": "https://dagworld.com/georgekeyt.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/e/george_keyt_cover.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/e/keytg0024_1.jpg",
            "title": "Untitled",
            "year": null,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/e/georgekeyt_001c_1.jpg",
            "title": "Untitled (Two Women Amid Plants)",
            "year": 1947,
            "medium": "Oil on board"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/k/e/keytg0025.jpg",
            "title": "Untitled",
            "year": 1971,
            "medium": "Oil on canvas"
        }
    ]
}