{
    "name": "Gobardhan Ash",
    "year": "1907 - 1996",
    "intro": "Born in 1907, Gobardhan Ash came into his own as an artist at a time when Indian art was in a state of historical flux, when the imagination of young artists was infused with the spirit of country’s freedom from colonial rule.",
    "bio": "He trained at the Government College of Art in Calcutta from 1926-30, and at the Government School of Arts and Crafts, Madras, till 1932. He was an active member of various artist collectives such as the Calcutta Group that he joined in 1950, the Art Rebel Centre, and the Young Artists Union, of which he was a founder member.\nA prolific yet reclusive artist, Ash worked in a variety of mediums, including watercolour, tempera, acrylic, and oil; he was also a fine draughtsman. Starting out with landscapes and portraits, Ash evolved as an artist by experimenting with naturalistic and socio-realistic themes, and abstract expressionism. Common people toiling hard to earn their livelihood were frequent subjects in Ash’s earlier works. One of his most acclaimed series was on the ravages of the 1943 Bengal famine that killed millions of people; a documentary film on the artist and his famine series was commissioned by the Government of India in 1985.\nBeginning with the first prize of the Madras Fine Arts Society in 1936, Ash received several awards in his lifetime, including the West Bengal government’s Abanindra Puraskar in 1984. Filmmaker Nabyendu Chatterjee made a documentary on his life in the year he passed away.",
    "CurrentProductId": "2113",
    "LastArtProId": "2612",
    "profile": "https://dagworld.com/gobardhanash.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/g/o/gobhardan_ash.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/s/ashg033.jpg",
            "title": "Untitled",
            "year": 1988,
            "medium": "Gouache on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/s/ashg054.jpg",
            "title": "Untitled",
            "year": 1985,
            "medium": "Gouache on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/s/ashg097.jpg",
            "title": "Untitled",
            "year": 1992,
            "medium": "Oil on canvas"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/s/ashg428_1_1.jpg",
            "title": "Untitled",
            "year": 1950,
            "medium": "Gouache on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/a/s/ashg437_1_.jpg",
            "title": "Untitled",
            "year": 1994,
            "medium": "Watercolour on paper pasted on mount board"
        }
    ]
}