{
    "name": "F. B. Solvyns",
    "year": "1760 - 1824",
    "intro": "Flemish marine painter and one of the early pioneers of printmaking in India, François Balthazar Solvyns was born in Antwerp, Belgium, on 6 July 1760, in a prominent merchant family.",
    "bio": "Political unrest in Europe brought him to India to seek his fortune. Solvyns lived in Calcutta from 1791-1803, working on etchings portraying the city and the people of Bengal. He commenced by painting for the theatres, accepting small commissions, and sketching the islands of Andaman and Nicobar for the Surveyor-General of India, Alexander Kyd.\nEncouraged by the Orientalist Sir William Jones, and British interest in the lifestyles of the Indians, Solvyns decided to produce a comprehensive record of Indian festivals, occupations, castes, musical instruments, asceticism, and transport. After limited printing in 1796, he published in 1799 A Collection of Two Hundred and Fifty Coloured Etchings, Descriptive of the Manners, Customs and Dress of the Hindoos, in Calcutta. Living in Paris from 1803 to 1814, Solvyns redid the etchings and published two hundred and eighty-eight plates in four volumes, titled Les Hindoûs.\nThese first-ever etchings are the earliest ethnographic survey of the people and their life in Bengal, encyclopaedic in nature and prototypes of the Company School of painting. Compelling, the figures are individual in character, an ordered portrayal of the Hindu caste division prevalent in society two hundred years ago. In that sense, Solvyns’s work becomes even more significant today from a historical and social perspective of India.\nHe returned to Antwerp from Paris in 1814, where he passed away on 10 October 1824.",
    "CurrentProductId": "4610",
    "LastArtProId": "5446",
    "profile": "https://dagworld.com/f-b-solvyns.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/f/b/fb_solvyns.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb09.jpg",
            "title": "Gouallahs",
            "year": 1808,
            "medium": "Etching, tinted with watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb02.jpg",
            "title": "B'haut",
            "year": 1808,
            "medium": "Etching, tinted with watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb03.jpg",
            "title": "Porteurs de Rouannys, caste",
            "year": 1808,
            "medium": "Etching, tinted with watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb06.jpg",
            "title": "Koummars",
            "year": 1808,
            "medium": "Etching, tinted with watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb10.jpg",
            "title": "Dandys",
            "year": 1808,
            "medium": "Etching, tinted with watercolour on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/s/o/solvynsfb0058.jpg",
            "title": "A Behaleea",
            "year": 1796,
            "medium": "Etching, tinted with watercolour on paper pasted on paper"
        }
    ]
}