{
    "name": "Zarina Hashmi",
    "year": "1937 - 2020",
    "intro": "Zarina Hashmi née Rasheed (she dropped her surname in later life) was born on 16 July 1937 in Aligarh to Sheikh Abdur Rasheed, a professor of history at the Aligarh Muslim University (AMU).",
    "bio": "She was ten at the time of the Partition and the consequent events impacted her life and her art forever, especially since her family chose to migrate to Pakistan some years later.\nZarina graduated in mathematics from AMU in 1958 and soon married Indian Foreign Service officer Saad Hashmi at the age of twenty-one. Travelling the world with her husband, the peripatetic nature of her new life came to be the second biggest denominator of her art following the Partition, both informing her lifelong quest for home, a recurrent theme in her works.\nWhile on a Paris posting, she studied printmaking under S. W. Hayter at Atelier 17, from 1963-67, and in 1974 she joined the Toshi Yoshido Studio in Tokyo to study woodblock printing. In 1977, when based in New York, her husband passed away and Hashmi decided to make the city her home for the rest of her life.\nEngaging herself in the politics of space, the artist questioned identity, the meaning of home, the urge for roots, borders and memory. In a series of works titled Maps, Homes and Itineraries, Mapping a Life and House with Four Walls, she challenged the actual space of cities by reconstructing the real maps in her minimalistic prints as fractured diagrams and angular lines, breaking through their borders. She taught printmaking at Bennington College, Cornell University, and at the University of California, Santa Cruz. \r\nBased in New York for most of her working life, she passed away in London on 25 April 2020.",
    "CurrentProductId": "2261",
    "LastArtProId": "5861",
    "profile": "https://dagworld.com/zarinahashmi.html",
    "image": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/z/a/zarinahashmi.jpg",
    "artworks": [
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/hashmiz45.jpg",
            "title": "Untitled",
            "year": 1972,
            "medium": "Serigraph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/hashmiz46.jpg",
            "title": "Untitled",
            "year": 1971,
            "medium": "Serigraph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/hashmiz56.jpg",
            "title": "Untitled",
            "year": 1971,
            "medium": "Serigraph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/hashmiz57.jpg",
            "title": "Untitled",
            "year": 1972,
            "medium": "Serigraph on paper"
        },
        {
            "painting": "https://d197irk3q85upd.cloudfront.net/catalog/product/cache/95dbdf78ad5a0d4b547132f80fbac8f3/h/a/hashmiz12_1.jpg",
            "title": "Untitled",
            "year": 1971,
            "medium": "Serigraph on paper"
        }
    ]
}